Repository: ubuntu-mate/ubuntu-mate.org
Catalog: _i18n/*/2019-03-28-ubuntu-mate-disco-beta.po
Languages: fr

source: **Ubuntu MATE 19.04 is a modest upgrade over previous releases. If you want bug fixes and improved hardware support then 19.04 is for you.**
fr: **Ubuntu MATE 19.04 est une amélioration modeste des versions précédentes. Si vous voulez la correction des bugs ou un meilleur support matériel, alors 19.04 est pour vous.**

source: We are preparing Ubuntu MATE 19.04 (Disco Dingo) for distribution on [April 18th, 2018](https://wiki.ubuntu.com/DiscoDingo/ReleaseSchedule) With this *Beta* pre-release, you can see what we are trying out in preparation for our next (stable) version.
fr: Nous préparons Ubuntu MATE 19.04 (Disco Dingo) pour distribution au [18 Avril 2018] (https://wiki.ubuntu.com/DiscoDingo/ReleaseSchedule) Avec cette *Beta* pre-release, vous pouvez voir ce que nous essayons en préparation de notre prochaine version (stable).

source: {:.center} ![Ubuntu MATE 19.04 Beta](/images/blog/1904-beta.png) **Ubuntu MATE 19.04 with the Mutiny layout**
fr: {:.center} ![Ubuntu MATE 19.04 Beta](/images/blog/1904-beta.png) **Ubuntu MATE 19.04 avec le layout Munity**

source: ## What works?
fr: ## Ce qui fonctionne ?

source: People tell us that Ubuntu MATE is stable. You may, or may not, agree.
fr: Des personnes nous disent que Ubuntu MATE est stable. Vous pouvez, où pas, être d'accord.

source: Ubuntu MATE *Beta Releases* are *NOT* recommended for:
fr: Les *versions bêta* Ubuntu MATE ne sont *PAS* recommandée pour :

source: * Regular users who are not aware of pre-release issues * Anyone who needs a stable system * Anyone uncomfortable running a possibly frequently broken system * Anyone in a production environment with data or workflows that need to be reliable
fr: * Utilisateurs lambda qui ne sont pas au courant des problèmes des pre-release * Quiconque ayant besoin d'un système stable * Les personnes qui ne sont pas à l‘aise avec un système qui peut souvent tomber en panne * LEs utilisateurs d‘un environnement de production utilisant des données où des flux ayant besoin d'être reliés

source: Ubuntu MATE *Beta Releases* are recommended for:
fr: Ubuntu MATE *Versions Bêta* sont recommandé pour :

source: * Regular users who want to help us test by finding, reporting, and/or fixing bugs * Ubuntu MATE, MATE, and GTK+ developers
fr: * Les utilisateurs réguliers qui veulent nous aider à tester en trouvant, rapportant et/ou corrigeant les bugs * Les développeurs d'Ubuntu MATE, MATE et GTK+.

source: ## What changed since the Ubuntu MATE 18.10 final release?
fr: ## Quels sont les changements depuis la version finale d'Ubuntu MATE 18.10 ?

source: Those of you who follow the desktop Linux news will know that upstream [MATE Desktop recently released version 1.22](https://mate-desktop.org/blog/2019-03-18-mate-1-22-released/).
fr: Ceux d'entre vous qui suivent l'actualité du bureau Linux sauront qu'en amont le [Bureau MATE a récemment sorti la version 1.22](https://mate-desktop.org/blog/2019-03-18-mate-1-22-released/).

source: Let's rip that band-aid off and get this over quickly. Ubuntu MATE 19.04 is shipping with MATE Desktop 1.20. Albeit, the latest maintenance release of MATE Desktop 1.20 with some of the bug fixes and new features from MATE Desktop 1.22 included. In fact, the version of MATE Desktop being shipped in 19.04 is derived from the same MATE packages that will feature in the upcoming [Debian 10 (Buster)](https://wiki.debian.org/DebianBuster) release.
fr: Commençons par arracher ce pansement et finissons-en vite. Ubuntu MATE 19.04 est livré avec le Bureau MATE 1.20. Toutefois, la dernière version de maintenance du Bureau MATE 1.20 avec quelques correctifs et nouvelles fonctionnalités du Bureau MATE 1.22 inclus. En fait, la version du Bureau MATE qui est livrée avec 190.4 est dérivée des mêmes paquets MATE qui seront fournis dans la version à venir de Debian,[Debian 10 (Buster)](https://wiki.debian.org/DebianBuster).

source: You may be wondering why we're not shipping MATE Desktop 1.22? The answer, stability. MATE Desktop 1.22 introduces some underlying API changes in core components and while all first party MATE Desktop applications are compatible with the changes and completely stable, some third party applications are not. Some third party applications are big crashers now and we've not been able to fix them in time.
fr: Vous vous demandez peut-être pourquoi nous n'avons pas livré le Bureau MATE 1.22 ? La réponse est: la stabilité. Le Bureau MATE 1.22 apporte quelques changements sous-jacents d'API dans des composants essentiels et, bien que toutes les applications de première partie du Bureau MATE soient compatibles avec les changements et parfaitement stables, quelques applications de troisième partie ne le sont pas. Ces applications plantent beaucoup à l'heure actuelle et nous n'avons pas été en mesure de les corriger.

source: So, we are playing it safe and sticking with MATE Desktop 1.20 and working with upstreams so we can land MATE Desktop 1.22 early in the Ubuntu MATE 19.10 development cycle.
fr: Alors, nous jouons la carte de la sécurité et restons avec le Bureau MATE 1.20 et travaillons en amont pour que le Bureau MATE 1.22 puisse atterrir tôt dans le cycle de développement d'Ubuntu MATE 19.10.

source: ### MATE Dock Applet
fr: ### Applet Dock MATE

source: [MATE Dock Applet](https://github.com/robint99/mate-dock-applet) has been updated to 0.88 which introduces some new visual options, both based on the look of the Unity desktop. As can be seen in the screenshot above these can be used to make the Mutiny layout more closely mimic Unity 7.
fr: L'[Applet MATE Dock](https://github.com/robint99/mate-dock-applet) a été mis à jour en version 0.88 qui apporte de nouvelles options visuelles, toutes les deux basées sur le look du bureau Unity. Comme en atteste la capture d'écran ci-dessus, Cela a été utilisé pour que la disposition Mutiny soit encore plus proche d'Unity 7.

source: ### Remote Desktop Awareness
fr: ### Conscience du Bureau à Distance

source: Our MATE Desktop 1.20 packages ship with patches to support [Remote Desktop Awareness (RDA)](https://github.com/ArcticaProject/librda). RDA makes MATE Desktop more aware of its execution context so that it behaves differently when run inside a remote desktop session compared to when running on local hardware. Different remote technology solutions support different features and they can now be queried from within MATE components. The inclusion of RDA offers the option to suspend your remote connection, supports folder sharing in Caja, MIME type bindings for SSHFS shares and allows session suspension via the MATE screensaver.
fr: Nos paquets du Bureau MATE 1.20 apportent des correctifs pour la prise en charge de la [Conscience du Bureau à Distance (RDA)](https://github.com/ArcticaProject/librda). La RDA permet au Bureau MATE d'être mieux au courant du contexte de l'exécution, de sorte qu'il se comporte différemment dans une session de bureau à distance ou sur du matériel local. Différentes solutions de la technologie à distance prennent en charge des fonctionnalités différentes et elles peuvent dorénavant être cherchées à partir des composants MATE. L'inclusion de la RDA permet de suspendre votre connexion à distance, de prendre en charge le partage de dossiers dans Caja et les liaisons de type MIME pour les partages SSHFS et permet la suspension de session par l'économisateur d'écran MATE.

source: title = "Download Ubuntu MATE Today" text = "" button_text = "Download" button_url = "/download/"
fr: title = "Téléchargez Ubuntu MATE Aujourd'hui" text = "" button_text = "Télécharger" button_url = "/download/"

source: ## Known Issues
fr: ## Problèmes Connus

source: Here are the known issues.
fr: Voici les problèmes connus.

source: * The Software Boutique doesn't list any available software. * An update, due very soon, will re-stock the software library and add a few new applications too.
fr: * La Boutique de Logiciels ne contient aucun logiciel disponible. * Une mise à jour, qui ne devrait pas tarder, rechargera la bibliothèque de logiciels et y ajoutera quelques unes au passage.

source: ### Ubuntu family issues
fr: ### Problèmes de la famille Ubuntu

source: This is our known list of bugs that affects all flavours.
fr: Ceci est notre liste de problèmes connus qui affectent toutes les variantes.

source: * [Ubiquity slide shows are missing for OEM installs of Ubuntu MATE and Ubuntu Budgie](https://pad.lv/1713720) * To work around this, run `apt install oem-config-slideshow-ubuntu-mate` in the OEM prepare session.
fr: * [Les diaporamas d'Ubiquity pour les installations OEM d'Ubuntu MATE et Ubuntu Budgie ne sont pas disponibles](https://pad.lv/1713720) * À titre de solution, exécutez `apt install oem-config-slideshow-ubuntu-mate` dans la session de préparation de l'OEM.

source: You'll also want to check the Ubuntu MATE bug tracker to see what has already been reported. These issues will be addressed in due course.
fr: Vous voudrez aussi jeter un œil au tracker de bugs d'Ubuntu MATE pour voir ce qui a déjà été rapporté. Ces problème seront réglés en temps voulu.

source: * [Ubuntu MATE Bug Tracker](https://bugs.launchpad.net/ubuntu-mate)
fr: * [Tracker de Bugs d'Ubuntu MATE](https://bugs.launchpad.net/ubuntu-mate)

source: ## Feedback
fr: ## Commentaires

source: Is there anything you can help with or want to be involved in? Maybe you just want to discuss your experiences or ask the maintainers some questions. Please [come and talk to us](https://ubuntu-mate.community/).
fr: Pourriez-vous nous aider de quelque façon que ce soit ou voudriez-vous vous impliquer ? Peut-être voudriez vous simplement discuter de vos expériences ou poser quelques questions aux mainteneurs. S'il-vous-plaît, [venez nous parler](https://ubuntu-mate.community/).
