Repository: ubuntu-mate/ubuntu-mate.org
Catalog: _i18n/*/2020-04-02-ubuntu-mate-focal.po
Languages: fr

source: title: Ubuntu MATE 20.04 Release Notes
fr: title: Notes de Version d'Ubuntu MATE 20.04

source: Ubuntu MATE 20.04 LTS represents 2 years :sweat_drops: of continued improvement to [MATE Desktop](https://mate-desktop.org) and Ubuntu MATE itself. For Ubuntu MATE 19.10 we [focused on addressing as many *"paper-cut"* issues as possible](/blog/ubuntu-mate-19-10-eoan-ermine-release/). That was a hugely successful :tada: initiative, the community feedback was overwhelmingly positive :chart_with_upwards_trend: and that is reflected in adoption; **the Ubuntu MATE 19.10 interim release is our most actively used interim release to date!** :champagne: This was only possible thanks to dedicated group of QA testers [joining the Ubuntu MATE team](/about/team/) and coordinating with developers to highlight :flashlight: where attention was needed.
fr: Ubuntu MATE 20.04 LTS représente deux années :sweat_drops: of d'amélioration continue du [Bureau MATE](https://mate-desktop.org) et d'Ubuntu MATE lui-même. Pour Ubuntu MATE 19.10 nous [nous étions concentrés afin de résoudre le maximum possible de *"petits"* problèmes](/blog/ubuntu-mate-19-10-eoan-ermine-release/). Ce fut une initiative couronnée de succès :tada: , les commentaires de la communauté furent extrêmement positifs :chart_with_upwards_trend: et on le constate avec son adoption; **la version intermédiaire d'Ubuntu 19.10 est notre version intermédiaire la plus activement utilisée à ce jour !** :champagne: Ce fut possible uniquement grâce à un groupe dévoué de testeurs AQ [rejoindre l'équipe Ubuntu MATE](/about/team/) et à la coordination avec les développeurs pour mettre en lumière :flashlight: les choses qui nécessitaient de l'attention.

source: Recognising that we're on to a good thing, :thumbsup: we've repeated this trick for Ubuntu MATE 20.04 LTS by once again by focusing :eyes: on the pain points our community is most vocal :loudspeaker: about. You'll find details of everything we've improved or fixed since 19.10 plus a summary of what's changed since 18.04 below :point_down:
fr: En reconnaissant que nous sommes dans la bonne direction, :thumbsup: nous avons répété l'astuce pour Ubuntu MATE 20.04 LTS en nous concentrant une nouvelle fois :eyes: sur les points qui faisaient vociférer :loudspeaker: le plus notre communauté. Vous trouverez ci-dessous les détails de toutes nos améliorations ou corrections depuis 19.10 ainsi qu'un résumé des changements depuis 18.04 :point_down:

source: **I'd like to extend my sincere thanks to everyone who has played an active role in improving Ubuntu MATE for this LTS release :clap: From reporting bugs, submitting translations, providing patches, contributing to our crowd funding, developing new features, creating artwork, offering community support, actively testing and providing QA feedback to writing documentation or creating this fabulous website. Thank you! Thank you all for getting out there and making a difference!** :green_heart:
fr: **J'aimerais sincèrement remercier tout le monde qui a joué un rôle actif dans l'amélioration d'Ubuntu MATE pour cette version LTS :clap: Des rapports de bugs à la soumission des traductions, la fourniture de correctifs, les contributions au financement participatif, le développement de nouvelles fonctionnalités, la création d'illustrations, les propositions d'aide à la communauté, ceux qui ont activement testé et fourni commentaires AQ pour écrire la documentation ou créer ce site fabuleux. Merci ! Merci à tous d'être venus faire une différence !** :green_heart:

source: {:.center} ![Ubuntu MATE 20.04 Desktop](/images/blog/focal/focal-fossa-desktop.png) **Ubuntu MATE 20.04 - Welcome now offers a few buckets of paint!**
fr: {:.center} ![Bureau d'Ubuntu MATE 20.04](/images/blog/focal/focal-fossa-desktop.png) **Ubuntu MATE 20.04 - Welcome now offers a few buckets of paint!**

source: ## What changed since the Ubuntu MATE 18.04 LTS?
fr: ## Quels sont les changements depuis Ubuntu MATE 18.04 LTS ?

source: Those of you who follow the desktop Linux news will know that upstream [MATE Desktop recently released version 1.24](https://mate-desktop.org/blog/2020-02-10-mate-1-24-released/). Ubuntu MATE 20.04 is shipping with MATE Desktop 1.24. Thus, all of the improvements in MATE Desktop 1.24 are present in Ubuntu MATE 20.04 LTS.
fr: Ceux d'entre vous qui suivent l'actualité du bureau Linux sauront qu'en amont le [Bureau MATE est récemment sorti en version 1.24](https://mate-desktop.org/blog/2020-02-10-mate-1-24-released/). Ubuntu MATE 20.04 est fourni avec le Bureau MATE 1.24. Ainsi, toutes les améliorations du Bureau MATE 1.24 sont présentes dans Ubuntu MATE 20.04 LTS.

source: **Since the last LTS we worked on the following**:
fr: **Depuis la dernière LTS nous avons travaillé sur les choses suivantes**:

source: * Added multiple coloured theme variations :art: as one-click installs for those of you who simply don't like Chelsea Cucumber :cucumber: * Added *experimental* ZFS :file_folder: install option. * Added GameMode :video_game: from [Feral Interactive](https://github.com/FeralInteractive/gamemode). * Fixed several crashers :bomb: in Brisk Menu and added keyboard :keyboard: navigation. * Fixed panel layout switching :hammer_and_wrench: which is now stable and reliable via MATE Tweak Tweak and Ubuntu MATE Welcome. * Fixed rendering window controls on HiDPI :mag: displays. * Fixed irregular icon sizes :straight_ruler: in MATE Control Center and made them render nicely on HiDPI displays. * Fixed unresponsive Caja :file_folder: extensions. * Fixed `mate-power-manager` :electric_plug: to use upower-glib `get_devices2()`. * Fixed unresponsive Pluma :notebook: plugins. * Fixed a crasher :bomb: in MATE Dock Applet due to an Attribute error in `adjust_minimise_pos()`. * Fixed auto-start errors in `mate-session-manager`. * Fixed saving/restoring custom panel layouts via MATE Tweak. * Gave Ubuntu MATE Welcome a fresh coat of :paintbrush:. * Updated the Ubuntu MATE Guide :question: * Updated the Ubiquity Slideshow :performing_arts:
fr: * Ajouté de multiples variantes colorées du thème :art: à installer en un clic pour ceux qui ne tolèrent pas le Concombre de Chelsea :cucumber:. * Ajouté de l'option *expérimentale* d'installation ZFS :file_folder:. * Ajouté du GameMode :video_game: de [Feral Interactive](https://github.com/FeralInteractive/gamemode). * Corrigé plusieurs plantages :bomb: dans le Menu Brisk et ajouté la navigation au clavier :keyboard:. * Corrigé les changements entre les dispositions de tableaux de bord :hammer_and_wrench: qui s'effectuent dorénavant de manière stable et fiable par MATE Tweak et Ubuntu MATE Bienvenue. * Corrigé le rendu des contrôles des fenêtres sur les écrans HiDPI :mag:. * Corrigé les tailles d'icônes irrégulières :straight_ruler: dans le Centre de Contrôle MATE et permis leur bon rendu sur écrans HiDPI. * Corrigé les extensions de Caja :file_folder: qui ne répondaient pas. * Corrigé `mate-power-manager` :electric_plug: afin qu'il utilise upower-glib `get_devices2()`. * Corrigé les greffons de Pluma :notebook: qui ne répondaient pas. * Corrigé un plantage :bomb: dans l'applet MATE Dock lié à une erreur d'Attribut dans `adjust_minimise_pos()`. * Corrigé les erreurs de démarrage automatique dans `mate-session-manager`. * Corrigé la sauvegarde/la restauration des dispositions personnalisées de tableau de bord dans MATE Tweak. * Donné à Ubuntu MATE Bienvenue un petit coup de pinceau :paintbrush:. * Mis à jour le Guide Ubuntu MATE :question:. * Mis à jour le Diaporama d'Ubiquity :performing_arts:.

source: ## Firmware updater
fr: ## Utilitaire de mise à jour du firmware

source: We've add a GTK front end for `fwupd`; this application can:
fr: Nous avons ajouter une interface GTK pour 'fwupd'; cette application peut:

source: * Upgrade, Downgrade, & Reinstall firmware on devices supported by [Linux Vendor Firmware Service (LVFS)](https://fwupd.org/). * Unlock locked `fwupd` devices. * Verify firmware on supported devices. * Display all releases for a `fwupd` device.
fr: * Mettre à Niveau, Rétrograder, & Réinstaller le firmware des périphériques pris en charge par le [Linux Vendor Firmware Service (LVFS)](https://fwupd.org/). * Déverrouiller les périphériques verrouillés dans `fwupd`. * Vérifier le firmware des périphériques pris en charge. * Afficher toutes les versions pour un périphérique `fwupd`.

source: {:.center} ![Firmware](/images/blog/focal/firmware.png) **Ubuntu MATE 20.04 - Features an LVFS compatible Firmware management utility**
fr: {:.center} ![Firmware](/images/blog/focal/firmware.png) **Ubuntu MATE 20.04 - Fournit un utilitaire de gestion du firmware compatible avec LVFS**

source: ### Window Manager improvements
fr: ### Améliorations du Gestionnaire de Fenêtres

source: Marco is the Window Manager for MATE Desktop and in Ubuntu MATE 20.04 it brings a number of new features and fixes.
fr: Marco est le Gestionnaire de Fenêtres pour le Bureau MATE et dans Ubuntu MATE 20.04 il apporte un certain nombre de nouvelles fonctionnalités et correctifs.

source: **XPresent support is properly fixed**, which means that **screen tearing is now a thing of the past** and **invisible window corners are finally here!** Invisible window corners mean that windows can be easily resized :straight_ruler: without having to precisely grab the window corners. **HiDPI rendering improvements** fix a number of rendering problems that were present in various themes and components. **Most notably, windows controls are now HIDPI aware**.
fr: **La prise en charge de XPresent est proprement corrigée**, ce qui signifie que **les déchirures d'écran appartiennent dorénavant au passé** et les **coins invisibles des fenêtres sont enfin là !** Les coins invisibles des fenêtres permettent aux fenêtres d'être facilement redimensionnées :straight_ruler: sans avoir à accrocher leurs coins avec précision. **Améliorations du rendu HiDPI** corrige un certain nombre de problèmes de rendu qui étaient présent dans plusieurs thèmes et composants. **Plus particulièrement, les contrôles des fenêtres sont dorénavant au courant de la présence du HiDPI**.

source: * Magnus (see below) provides screen magnification * Marco supports invisible windows borders * Marco has improved <kbd>Alt</kbd> + <kbd>Tab</kbd> behaviour * Marco is free from screen tearing * Marco frame performance when gaming is further improved
fr: * Magnus (voir ci-dessous) permet le grossissement sur l'écran * Marco prend en charge les coins de fenêtres invisibles * Marco a amélioré le comportement de 1Alt1 + 2Tab2 * Marco ne souffre plus de déchirures d'écran * Les performances de Marco au niveau des trames dans les jeux ont été encore améliorées.

source: **Minimized Application Preview**
fr: **Aperçu de l'Application Minimisée**

source: Minimized applications in the window list now present a thumbnail preview.
fr: Les applications minimisées dans la liste des fenêtres comportent dorénavant une vignette d'aperçu.

source: {:.center} ![Minimized Preview](/images/blog/focal/taskbar-preview.png)
fr: {:.center} ![Aperçu de la fenêtre minimisée](/images/blog/focal/taskbar-preview.png)

source: **Alt+Tab navigation** makes it possible to traverse the application switcher via keyboard and mouse. <kbd>Alt</kbd> + <kbd>Tab</kbd>.
fr: **La navigation avec Alt+Tab** permet de traverser le changeur d'applications par le clavier et la souris.<kbd>Alt</kbd>+<kbd>Tab</kbd>.

source: {:.center} ![Alt-Tab Switcher](/images/blog/focal/alt-tab.png)
fr: {:.center} ![Le changeur Alt-Tab](/images/blog/focal/alt-tab.png)

source: **Workspace Switcher** allows you to switch between workspaces using a the keyboard and mouse. <kbd>Alt</kbd> + <kbd>Tab</kbd> + <kbd>Ctrl</kbd>.
fr: **Le Changeur d'Espaces de Travail** vous permet de basculer entre les espaces de travail en utilisant le clavier et la souris. <kbd>Alt</kbd> + <kbd>Tab</kbd> + <kbd>Ctrl</kbd>.

source: {:.center} ![Workspace Switcher](/images/blog/focal/workspace-switcher.png)
fr: {:.center} ![Changeur d'Espaces de Travail](/images/blog/focal/workspace-switcher.png)

source: **Compiz and Compton have been removed from the default Ubuntu MATE install**. The fundamental reasons for including them no longer exist.Only having one window manager to target means we can promptly deliver new features and minimise development effort. Which brings us to...
fr: **Compiz et Compton ont été supprimés de l'installation par défaut d'Ubuntu MATE.** Les raisons fondamentales de leur présence n'existent plus. Avoir un seul Gestionnaire de Fenêtres signifie que nous pouvons apporter rapidement de nouvelles fonctionnalités et limiter l'effort de développement. Ce qui nous amène à...

source: ### New Key-bindings
fr: ### Nouveaux Raccourcis Clavier

source: The key-bindings for window tiling have only worked on full keyboards :keyboard: with a 10-key pad. Few laptops :computer: have a 10-key pad and not all keyboards have a 10-key either. There are some well known key-bindings from other platforms that were not recognised in Ubuntu MATE. So, we've had a think :think: and have come up with this:
fr: Les raccourcis clavier pour la division des fenêtres ne fonctionnaient que sur les claviers complets :keyboard: avec un pavé numérique à 10 touches. Peu d'ordinateurs portables :computer: possèdent un tel pavé numérique et certains claviers n'en possèdent également pas. Il y a des raccourcis clavier bien connus des autres plateformes qui n'étaient pas reconnus dans Ubuntu MATE. Nous avons donc réfléchi :think: et sommes arrivés avec ceci:

source: * **Maximise Window:** <kbd>Super</kbd> + <kbd>Up</kbd> * **Restore Window:** <kbd>Super</kbd> + <kbd>Down</kbd> * **Title Window right:** <kbd>Super</kbd> + <kbd>Right</kbd> * **Title Window left:** <kbd>Super</kbd> + <kbd>Left</kbd> * **Center Window:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>c</kbd> * **Title Window to upper right corner:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * **Title Window to upper left corner:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * **Title Window to lower right corner:** <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * **Title Window to lower left Corner:** <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * **Shade Window:** <kbd>Control</kbd> + <kbd>Alt</kbd> + <kbd>s</kbd>
fr: * **Maximiser la Fenêtre:** <kbd>Super</kbd> + <kbd>Up</kbd> * **Restaurer la Fenêtre:** <kbd>Super</kbd> + <kbd>Down</kbd> * **Plaquer la Fenêtre à droite:** <kbd>Super</kbd> + <kbd>Right</kbd> * **Plaquer la Fenêtre à gauche:** <kbd>Super</kbd> + <kbd>Left</kbd> * **Centrer la Fenêtre:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>c</kbd> * **Plaquer la Fenêtre dans le coin supérieur droit:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * **Plaquer la Fenêtre dans le coin supérieur gauche:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * **Plaquer la Fenêtre dans le coin inférieur gauche:** <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * **Plaquer la Fenêtre dans le coin inférieur gauche:** <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * **Masquer la Fenêtre:** <kbd>Control</kbd> + <kbd>Alt</kbd> + <kbd>s</kbd>

source: It is now possible to tile a window to all screen quadrants :triangular_ruler: using any keyboard form factor. We updated the application launcher key-bindings, some of these have existed in Ubuntu MATE for a while:
fr: Il est maintenant possible de plaquer une fenêtre sur les quatre coins :triangular_ruler: en utilisant un clavier de n'importe quelle format. Nous avons mis à jour les raccourcis du lanceur d'applications, certains étaient là depuis un bon bout de temps dans Ubuntu MATE.

source: * **Cycle external displays:** <kbd>Super</kbd> + <kbd>P</kbd> * **Lock Screen:** <kbd>Super</kbd> + <kbd>L</kbd> * **Screenshot a rectangle:** <kbd>Shift</kbd> + <kbd>PrintScr</kbd> * **Open File Manager:** <kbd>Super</kbd> + <kbd>e</kbd> * **Open Terminal:** <kbd>Super</kbd> + <kbd>T</kbd> * **Open Control Center:** <kbd>Super</kbd> + <kbd>I</kbd> * **Open Search:** <kbd>Super</kbd> + <kbd>S</kbd> * **Open Task Manager:** <kbd>Control</kbd> + <kbd>Shift</kbd> + <kbd>Escape</kbd> * **Open System Information:** <kbd>Super</kbd> + <kbd>Pause</kbd>
fr: * **Basculer entre les écrans externes:** <kbd>Super</kbd> + <kbd>P</kbd> * **Verrouiller l'écran:** <kbd>Super</kbd> + <kbd>L</kbd> * **Capture d'écran d'un rectangle:** <kbd>Maj</kbd> + <kbd>ImprEcr</kbd> * **Ouvrir le Gestionnaire de Fichiers:** <kbd>Super</kbd> + <kbd>e</kbd> * **Ouvrir le Terminal:** <kbd>Super</kbd> + <kbd>T</kbd> * **Ouvrir le Centre de Contrôle:** <kbd>Super</kbd> + <kbd>I</kbd> * **Ouvrir la Recherche :** <kbd>Super</kbd> + <kbd>S</kbd> * **Ouvrir le Gestionnaire de Tâches:** <kbd>Ctrl</kbd> + <kbd>Maj</kbd> + <kbd>Échap</kbd> * **Ouvrir les Informations Système:** <kbd>Super</kbd> + <kbd>Pause</kbd>

source: The key-bindings compliment existing well established alternatives. So if <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>T</kbd> (Terminal) and <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>L</kbd> (Lock Screen) are ingrained in your muscle :muscle: memory 🧠 they are still available too. You can find all the keyboard shortcuts documented in the **Getting Started section of Ubuntu MATE Welcome**.
fr: Les raccourcis clavier complémentent des alternatives existantes bien établies. Donc, si <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>T</kbd> (Terminal) et <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>L</kbd> (Verrouillage de l'écran) sont enregistrés dans votre mémoire musculaire :muscle: 🧠 ils seront toujours disponibles. Vous pouvez retrouver tous les raccourcis clavier dans la section **Démarrer d'Ubuntu MATE Bienvenue**.

source: ### Brisk Menu
fr: ### Menu Brisk

source: [Brisk Menu](https://github.com/getsolus/brisk-menu) is under the Solus GitHub organisation, but it's been a couple of years since it had a new release. The Solus Project gave me administrative access :trident: to the Brisk Menu repo and I've made a new release. Thanks to the efforts of a couple of Ubuntu MATE contributors, several bug :bug: fixes have landed too, which includes **resolving frequent crashers :bomb: in Brisk Menu, preventing a scrollbar always appearing in the category column** of the menu, **silencing sounds firing as you rollover menu entries** and **adding keyboard :keyboard: navigation**.
fr: Le [Menu Brisk](https://github.com/getsolus/brisk-menu) se situe dans l'organisation Solus sur GitHub , mais il n'y a pas eu de nouvelle version depuis deux ans. Le Projet Solus m'a donné un accès administrateur :trident: au dépôt du Menu Brisk et j'ai préparé une nouvelle version. Grâce aux efforts de quelques contributeurs d'Ubuntu MATE, quelques correctifs de bugs :bug: fixes ont été réalisés, qui résolvent notamment **les plantages fréquents :bomb: dans le Menu Brisk et empêchent l'apparition permanente d'une barre de déroulement dans la colonne catégorie** du menu, **font taire les sons qui vous tiraient dessus quand vous survoliez les entrées de menu** et **ajoutent la navigation au clavier :keyboard: **.

source: ### MATE Panel
fr: ### Tableau de Bord MATE

source: MATE Panel has had a long-standing bug fixed that caused it to crash :boom: when the panel was reset or replaced. This was most noticeable when switching panel layouts via MATE Tweak and could result in the panel layout being left incomplete or entirely absent. This bug is now fixed! MATE Tweak has been updated to neatly integrate with with fixed MATE Panel behaviour so that **layout switching is now 100% reliable**.
fr: Le Tableau de Bord MATE était frappé d'un bug de longue date, désormais corrigé, qui entraînait son plantage :boom: quand le tableau de bord était réinitialisé ou remplacé. On y était confronté tout particulièrement en changeant de dispositions de tableaux de bord avec MATE Tweak et cela pouvait rendre la disposition incomplète voire absente. Ce bug est dorénavant corrigé ! MATE Tweak a été mis à jour pour intégrer proprement les comportements corrigés du Tableau de Bord MATE de sorte que **le changement de disposition soit désormais 100% fiable**.

source: ### Indicators
fr: ### Indicateurs

source: A bug which resulted in **oversized icons in indicators is finally resolved**.
fr: Un bug qui entraînait **des icônes surdimensionnées dans les indicateurs est désormais résolu**.

source: {:.center .transparent} | ![Before](/images/blog/eoan/indicators-before.png) | ![After](/images/blog/eoan/indicators-after.png) | **Before** :poop: | **After** :heart_eyes:
fr: {:.center .transparent} | ![Avant](/images/blog/eoan/indicators-before.png) | ![Après](/images/blog/eoan/indicators-after.png) | **Avant** :poop: | **Après** :heart_eyes:

source: However, it turned out some of the bugs were due to the icons :art: themselves. Over :100: icons have been refactored :paintbrush:️ to correct their resolutions or aspect ratio; as a result the panel and indicators both scale correctly.
fr: Toutefois, il s'est avéré que certains bugs étaient intrinsèquement dus aux icônes :art:. Plus de :100: icônes ont été remaniées :paintbrush: afin de corriger leurs résolutions ou leur rapport d'aspect; en conséquence, le tableau de bord et les indicateurs se mettent à l'échelle correctement.

source: A race condition that could result in **two network status icons being displayed is fixed**, and **when connected via VPN, lock icons are now overlayed on the Network Indicator**. The battery :battery: indicator is improved and now has a larger **charging symbol while charging**.
fr: Une condition de course qui pouvait entraîner **l'apparition de deux icônes d'état du réseau a été corrigée**, et **lors d'une connexion à un VPN, les icônes de verrouillage sont dorénavant superposées à l'Indicateur de Réseau**. L'indicateur de batterie :battery: a été amélioré et possède dorénavant un plus grand **symbole de chargement lors de la charge**.

source: We've **added the Date/Time Indicator and integrated it with MATE Desktop and it now replaces the MATE clock applet** which corrects the placement of the clock and session indicators.
fr: Nous avons **ajouté l'Indicateur de Date/Heure et l'avons intégré avec le Bureau MATE et il remplace dorénavant l'applet horloge MATE** qui corrige le placement de l'horloge et des indicateurs de session.

source: We've finally addressed a long standing issue which has been around since Ubuntu MATE 14.10 🕸️: some of the monochrome symbolic icons used in the indicators were also used in applications. The presented a couple of issues:
fr: Nous avons enfin résolu un problème de longue date qui remontait à Ubuntu MATE 14.10 🕸️ certaines des icônes symboliques monochromes utilisées dans les indicateurs l'étaient également dans les applications. Cela entraînait quelques problèmes:

source: * In certain cases, you couldn't easily see the icons against the window base colour. * The mix of monochrome and full colour icons in applications looked inconsistent.
fr: * Dans certaines situations, vous ne pouviez pas aisément voir les icônes contre la couleur de base de la fenêtre. * Le mélange du monochrome et des icônes colorées dans les applications paraissait incohérent.

source: This issue is now resolved; **monochrome symbolic icons are only used for indicators and full colour icons are used in the Control Center, Sound Preferences, Bluetooth, OSD, etc**.
fr: Cette issue est maintenant résolue; **les icônes symboliques monochromes sont seulement utilisées pour les indicateurs et les icônes colorées le sont uniquement dans le Centre de Contrôle, les Préférences de Son, le Bluetooth, l'OSD, etc**...

source: ### MATE Window Applets
fr: ### Applets de Fenêtre MATE
