Repository: ubuntu-mate/ubuntu-mate.org
Catalog: _i18n/*/2020-04-02-ubuntu-mate-focal.po
Languages: fr

source: [MATE Window Applets](https://github.com/ubuntu-mate/mate-window-applets) have received a number of bug fixes and new features from a community contributor. Window control icons now dynamically load from the currently selected theme, rather than requiring manual user configuration. **A number of bugs (including significant memory leaks) have also been resolved**.
fr: [Les Applets de Fenêtre MATE](https://github.com/ubuntu-mate/mate-window-applets) ont reçu un certain nombre de correctifs de bugs et de nouvelles fonctionnalités de la part d'un contributeur de la communauté. Les icônes de contrôle des fenêtres sont dorénavant chargées dynamiquement à partir du thème actuellement sélectionné au lieu de nécessiter la configuration manuelle par l'utilisateur. **Un certain nombre de bugs (y compris des fuites de mémoire significatives) ont également été résolus**.

source: ## Notification Center
fr: ## Centre de Notification

source: Ubuntu MATE 20.04 includes a **new Indicator that provides a "notification center"** :bell: We worked with the [upstream developer to add new features to indicator-notifications](https://github.com/trism/indicator-notifications) and integrate it with MATE Notifications Daemon.
fr: Ubuntu MATE 20.04 intègre un **nouvel Indicateur qui fournit un "centre de notifications"** :bell: Nous avons travaillé en [amont avec le développeur pour ajouter des nouvelles fonctionnalités à indicator-notifications](https://github.com/trism/indicator-notifications) et l'avons intégré avec le Daemon de Notifications MATE.

source: {:.center} ![Notification Settings](/images/blog/eoan/notification-settings.png)
fr: {:.center} ![Réglages des Notifications](/images/blog/eoan/notification-settings.png)

source: We now have a **notification center that also offers a "do not disturb" :red_circle: feature**. When do not disturb is enabled, notifications will be muted and captured in the notification center for review. It's also **possible to blacklist some notifications**, so they are never stored by the notification center. I've created an icon theme for the notification center so it fits the look and feel of the default Ubuntu MATE theme. **Notification hints are also fixed** so any notifications supplying additional media, such as sounds or icons, now work.
fr: Nous disposons dorénavant d'un **centre de notifications qui propose également une fonction "ne pas déranger" :red_circle:**. Quand "ne pas déranger" est activé, les notifications seront silencieuses et capturées dans le centre de notifications pour y être passées en revue. Il est également **possible de mettre certaines notifications en liste noire**, ainsi elles ne figureront jamais dans le centre de notifications. J'ai créé un thème d'icônes pour le centre de notifications pour qu'il soit vraiment raccord avec le thème par défaut d'Ubuntu MATE. **Les indices de Notifications sont également corrigés**. Ainsi, toutes les notifications comportant des médias supplémentaires, tels des sons ou icônes, fonctionneront désormais.

source: ## Evolution replaces Thunderbird
fr: ## Evolution remplace Thunderbird

source: The Ubuntu MATE development team discussed the pros and cons of switching the default mail :email: client in Ubuntu MATE to [Evolution](https://wiki.gnome.org/Apps/Evolution). Here is a summary of our assessment:
fr: L'équipe de développement d'Ubuntu MATE a discuté des avantages et inconvénients du changement du client mail :email: par défaut dans Ubuntu MATE pour [Evolution](https://wiki.gnome.org/Apps/Evolution). Voici un résumé de notre évaluation:

source: * Thunderbird does not integrate as well with the desktop. * For example, theme integration, font integration, compatibility with HUD (which is increasingly difficult to support in Thunderbird), notifications with action buttons, locale and spell checking. * Evolution integrates well with MATE Desktop given that both use GTK3. * **Evolution includes interoperability with LibreOffice**, for which Ubuntu MATE is already shipping the required components. * Evolution has superior **integration with Google Mail and Exchange**, including calendar, contacts, tasks, and memos.
fr: * Thunderbird ne s'intègre pas aussi bien au bureau. * Par exemple, l'intégration du thème et des polices, la compatibilité avec le HUD (qui est de plus en plus difficile à prendre en charge dans Thunderbird), les notifications avec des boutons d'action, les locales et la vérification orthographique. * Evolution s'intègre bien au Bureau MATE compte tenu que tous deux utilisent GTK3. * **Evolution intègre l'interopérabilité avec LibreOffice**, pour laquelle Ubuntu MATE propose déjà tous les composants requis. * Evolution a une **intégration supérieure avec Google Mail et Exchange**, y compris le calendrier, les contacts, les tâches et les mémos.

source: **Indicator Date/Time also integrates with Evolution**. It is fully functional, including all the features of creating new events or opening upcoming events from the indicator. Clicking on an individual day in the month displays the events for that day, etc.
fr: **L'indicateur Date/Heure s'intègre aussi avec Evolution**. Il est pleinement fonctionnel, y compris les fonctionnalités pour créer de nouveaux rendez-vous ou ouvrir les rendez-vous à venir à partir de l'indicateur. Cliquer sur un jour individuel du mois affiche les rendez-vous prévus pour ce jour-là, etc.

source: {:.center} ![Indicator Date Time](/images/blog/eoan/indicator-datetime.png)
fr: {:.center} ![L'indicateur Date/Heure](/images/blog/eoan/indicator-datetime.png)

source: For the many people who use web-mail exclusively, this change will have no impact, but for those who use desktop mail we feel these productivity :chart_with_upwards_trend: improvements are significant.
fr: Pour bien des gens qui utilisent exclusivement le webmail, ce changement n'aura aucun impact, mais pour ceux qui utilisent un client de bureau, ces gains de productivité :chart_with_upwards_trend: sont significatifs.

source: For those of you who love :two_hearts: Thunderbird and wish to continue using it, we will continue to offer Thunderbird in the Software Boutique for a one-click install. Likewise, Evolution is now in the Software Boutique, and can be installed/removed with one click.
fr: Pour ceux d'entre vous qui adorent :two_hearts: Thunderbird et souhaitent continuer à l'utiliser, nous continuerons à proposer Thunderbird dans la Boutique de Logiciels avec une installation en un clic. De même, Evolution est dorénavant dans la Boutique de Logiciels, et peut être installé/supprimé en un clic également.

source: Most desktop environments are lacking a screen magnifier, which is an essential application for visually impaired :eyeglasses: computer users, as well as accurate graphical design or detail work. One of the reasons we ship Compiz in Ubuntu MATE is because it has an excellent screen magnifier and was our solution for people who need magnification :mag:
fr: La plupart des environnements de bureau n'ont pas de loupe grossissante, ce qui est une application essentielle pour les utilisateurs d'ordinateur malvoyants :eyeglasses:, tout comme pour la conception graphique précise ou du travail de détail. L'une des raisons pour lesquelles nous livrons Compiz avec Ubuntu MATE est son excellente loupe grossissante qui était notre solution pour les gens qui en ont besoin :mag:

source: {:.center} ![Magnus for zooming into the screen](/images/blog/eoan/magnus.png)
fr: {:.center} ![Magnus pour zoomer sur l'écran](/images/blog/eoan/magnus.png)

source: Martin and [Stuart Langridge](https://twitter.com/sil) collaborated to create [Magnus](https://kryogenix.org/code/magnus/); **a very simple desktop magnifier**, showing the area around the mouse pointer in a separate window magnified two, three, four, or five times. Magnus is now shipped :ship: by default in Ubuntu MATE 20.04.
fr: Martin et [Stuart Langridge](https://twitter.com/sil) ont collaboré pour créer [Magnus](https://kryogenix.org/code/magnus/); **une loupe de bureau simplissime**, montrant la zone autour du pointeur de la souris dans une fenêtre séparée et zoomée deux, trois, quatre ou cinq fois. Magnus est dorénavant livré :ship: par défaut dans Ubuntu MATE 20.04.

source: ## Ubuntu MATE Themes
fr: ## Thèmes d'Ubuntu MATE

source: Dozens of theme-related bugs have been fixed. The Ubuntu MATE themes have been added to the `gtk-common-themes` used by snaps, **so snapped applications are now themed correctly for Ubuntu MATE users**. This change is already available all the way back to Ubuntu MATE 16.04.
fr: Des douzaines de bugs relatifs aux thèmes ont été corrigés. Les thèmes d'Ubuntu MATE ont été ajoutés aux `gtk-common-themes` utilisés par les snaps, **ainsi les thèmes fonctionnent dorénavant correctement avec les applications snaps pour les utilisateurs d'Ubuntu MATE**. Ce changement est déjà disponible pour les versions précédentes jusqu'à Ubuntu MATE 16.04.

source: The most noticeable resolved theme issues are **sensibly sized expanders in tree view** (they were so tiny) that are easily clickable, **window controls are correctly proportioned on CSD windows** and we've add a splash of Chelsea Cucumber :bug: to the Ubuntu MATE logo on the menu. Everything the QA team highlighted has been fixed :hammer:
fr: Les problèmes de thèmes corrigés les plus visibles sont les **élargisseurs de petite taille dans la vue en arborescence** (ils étaient si minuscules) qui sont désormais facilement cliquables, **Les contrôles de fenêtres sont dorénavant correctement proportionnés sur les fenêtres CSD** et nous avons ajouté une couche de Concombre de Chelsea :bug: sur le logo Ubuntu MATE sur le menu. Tout ce que l'équipe AQ avait remarqué a été corrigé :hammer:

source: ## MATE Tweak and Ubuntu MATE Welcome
fr: ## MATE Tweak et Ubuntu MATE Bienvenue

source: MATE Tweak now **preserves user preferences when switching between custom layouts** thanks to a community contribution.
fr: MATE Tweak **préserve dorénavant les préférences utilisateurs quand on bascule entre les dispositions personnalisées** grâce à une contribution de la communauté.

source: If you're familiar with MATE Tweak, you'll know it can switch panel layouts to somewhat mimic other platforms and distros 🐧 We have now integrated a graphical layout switcher in Ubuntu MATE Welcome to better promote the feature and make it more accessible. We have actually had this feature since 18.04, but the bugs in MATE Panel I mentioned earlier meant it didn't work. With all the associated panel bugs fixed :wrench: we now have this:
fr: Si vous êtes familier avec MATE Tweak, vous saurez que l'on peut changer de disposition de tableaux de bord afin d'imiter d'autres plateformes et distributions 🐧 Nous avons désormais intégré un changeur de disposition dans Ubuntu MATE Bienvenue afin de mieux promouvoir la fonctionnalité et la rendre plus accessible. Nous avions en fait cette fonctionnalité depuis 18.04, mais les bugs dans Tableau de Bord MATE que j'ai mentionnés plus tôt en empêchaient le fonctionnement. Avec tous les bugs relatifs au tableau de bord corrigés :wrench:, nous avons dorénavant ceci:

source: {:.center} ![Desktop Layout Switcher](/images/blog/eoan/desktop-layout.png)
fr: {:.center} ![Changeur de Disposition de Bureau](/images/blog/eoan/desktop-layout.png)

source: ## NVIDIA drivers
fr: ## Pilotes NVIDIA

source: If you've been following the news surrounding Ubuntu you'll know that Ubuntu will be shipping :ship: the NVIDIA proprietary drivers on the ISO images. Anyone selecting the additional 3rd party hardware drivers during installation without an Internet connection will have the drivers available in offline scenarios.
fr: Si vous avez suivi les nouvelles relatives à Ubuntu, vous saurez qu'Ubuntu sera livré :ship: avec les drivers propriétaires NVIDIA sur les images ISO. Quiconque sélectionne les pilotes de périphériques de 3ème partie durant l'installation sans une connexion internet pourra installer ces pilotes, même en étant hors ligne.

source: Post-install, Ubuntu MATE users with computers that support hybrid graphics will see the MATE Optimus hybrid graphics applet displaying the NVIDIA logo.
fr: Après installation, les utilisateurs d'Ubuntu MATE dont les ordinateurs prennent en charge les graphiques hybrides verront l'applet MATE Optimus graphiques hybrides afficher le logo NVIDIA.

source: We have given MATE Optimus an update. MATE Optimus adds support for NVIDIA On-Demand and will now prompt users to log out when switching the GPU's profile. MATE, XFCE, Budgie, Cinnamon, GNOME, KDE and LXQt are all supported. Wrappers, called `offload-glx` & `offload-vulkan`, can be used to easily offload games/apps to the PRIME renderer. **I'm also delighted to see Ubuntu Budgie 20.04 are shipping MATE Optimus too!**
fr: Nous avons mis à jour MATE Optimus. MATE Optimus ajoute la prise en charge de NVIDIA On-Demand et demandera dorénavant aux utilisateurs de se déconnecter quand ils changeront de profil GPU. MATE, XFCE, Budgie Cinnamon, GNOME, KDE and LXQt sont tous pris en charge. Les enveloppes appelées `offload-glx` & `offload-vulkan` peuvent être utilisées aisément pour décharger les jeux/apps au rendu PRIME. **J'ai aussi l'honneur de vous annoncer qu'Ubuntu Budgie 20.04 livre également MATE Optimus !**

source: The **NVIDIA drivers are now going to receive updates via the official Ubuntu software repository**. So no need to add a PPA to get updates and more importantly, **the NVIDIA drivers are signed (which is not supported for drivers distributed via PPA) so you can keep Secure Boot enabled.**
fr: Les **pilotes NVIDIA recevront des mises à jour par le dépôt de logiciels officiel d'Ubuntu**. Plus besoin d'ajouter un PPA pour obtenir des mises à jour et surtout, **les pilotes NVIDIA sont signés (ce qui n'est pas pris en charge par les pilotes distribués par PPA), vous permettant ainsi de maintenir activé le Secure Boot.**

source: ### Remote Desktop Awareness
fr: ### Conscience du Bureau à Distance

source: Our MATE Desktop 1.24 packages ship support for [Remote Desktop Awareness (RDA)](https://github.com/ArcticaProject/librda). RDA makes MATE Desktop more aware of its execution context, so it behaves differently when run inside a remote desktop session compared to when running on local hardware. Different remote technology solutions support different features and they can now be queried from within MATE components. The inclusion of RDA offers the option to suspend your remote connection, supports folder sharing in Caja and MIME type bindings for SSHFS shares, and allows session suspension via the MATE screensaver.
fr: Nos paquets du Bureau MATE 1.24 apportent des correctifs pour la prise en charge de la [Conscience du Bureau à Distance (RDA)](https://github.com/ArcticaProject/librda). La RDA permet au Bureau MATE d'être mieux au courant du contexte de l'exécution, de sorte qu'il se comporte différemment dans une session de bureau à distance ou sur du matériel local. Différentes solutions de la technologie à distance prennent en charge des fonctionnalités différentes et elles peuvent dorénavant être cherchées à partir des composants MATE. L'inclusion de la RDA permet de suspendre votre connexion à distance, de prendre en charge le partage de dossiers dans Caja et les liaisons de type MIME pour les partages SSHFS et permet la suspension de session par l'économisateur d'écran MATE.

source: ## ZFS on root
fr: ## ZFS sur root

source: {:.center} ![ZFS on Linux](/images/blog/eoan/zol-logo.png)
fr: {:.center} ![ZFS sur Linux](/images/blog/eoan/zol-logo.png)

source: Support for ZFS as the root filesystem is added as an experimental feature in 20.04. The ZFS file system and partitioning layout is handled automatically directly via the installer. `zsys` was added in 20.04 which now takes system snapshots before significant installs or upgrades and inserts restore options into the GRUB bootloader menus should you need to recover.
fr: La prise en charge du ZFS en tant que système de fichiers root a été ajoutée en tant que fonctionnalité expérimentale dans 20.04. Le système de fichiers ZFS et la disposition des partitions est gérée automatiquement, directement par l'installateur. `zsys` a été ajouté à 20.04 qui permet dorénavant des sauvegardes instantanées du système avant des installations ou mises à nouveau significatives et insère des options de restauration dans le chargeur d'amorçage GRUB qui devraient vous permettre de récupérer votre système.

source: You can read more details on Didier Roche's blogs:
fr: Vous pouvez lire plus de détails sur le blog de Didier Roche:

source: * [Part 1 - Ubuntu ZFS support in 19.10: introduction](https://didrocks.fr/2019/08/06/ubuntu-zfs-support-in-19.10-introduction/) * [Part 2 - Ubuntu ZFS support in 19.10: ZFS on root](https://didrocks.fr/2019/10/11/ubuntu-zfs-support-in-19.10-zfs-on-root/)
fr: * [Part 1 - Prise en charge de ZFS dans Ubuntu 19.10: introduction](https://didrocks.fr/2019/08/06/ubuntu-zfs-support-in-19.10-introduction/) * [Part 2 - Prise en charge de ZFS dans Ubuntu 19.10: ZFS sur root](https://didrocks.fr/2019/10/11/ubuntu-zfs-support-in-19.10-zfs-on-root/)

source: ## Major Applications
fr: ## Applications Majeures

source: Accompanying **MATE Desktop 1.24.0** and **Linux 5.4** are **Firefox 75.0**, **Celluloid 0.18**, **LibreOffice 6.4.2.2** and **Evolution 3.36.1**.
fr: Accompagnant le **Bureau MATE 1.24.0** et **Linux 5.4** il y a **Firefox 75.0**, **Celluloid 0.18**, **LibreOffice 6.4.2.2** et **Evolution 3.36.1**.

source: {:.center} ![Major Applications](/images/blog/focal/versions.png)
fr: {:.center} ![Applications Majeures](/images/blog/focal/versions.png)

source: See the [Ubuntu 20.04 Release Notes](https://wiki.ubuntu.com/FocalFossa/ReleaseNotes) for details of all the changes and improvements in Ubuntu that Ubuntu MATE benefits from.
fr: Voir les [Notes de Version d'Ubuntu 20.04](https://wiki.ubuntu.com/FocalFossa/ReleaseNotes) pour les détails de tous les changements et améliorations dans Ubuntu dont Ubuntu MATE tire profit.

source: title = "Download Ubuntu MATE Today" text = "" button_text = "Download" button_url = "/download/"
fr: title = "Téléchargez Ubuntu MATE Dès Aujourd'hui" text = "" button_text = "Télécharger" button_url = "/download/"

source: ## Upgrading from Ubuntu MATE 18.04 LTS or 19.10
fr: ## Mettre à niveau depuis Ubuntu MATE 18.04 LTS ou 19.10

source: You can upgrade to Ubuntu 20.04 LTS from either Ubuntu MATE 18.04 LTS or Ubuntu 19.10. Ensure that you have all updates installed for your current version of Ubuntu MATE before you upgrade.
fr: Vous pouvez mettre à niveau vers Ubuntu MATE 20.04 depuis Ubuntu MATE 18.04 LTS ou Ubuntu MATE 19.10. Assurez-vous que toutes les mises à jour aient été installées sur votre version présente d'Ubuntu MATE avant de mettre à niveau.

source: * Open the "Software & Updates" from the Control Center. * Select the 3rd Tab called "Updates". * Set the "Notify me of a new Ubuntu version" drop down menu to "For long-term support versions" if you are using 18.04 LTS; set it to "For any new version" if you are using 19.10. * Press <kbd>Alt</kbd>+<kbd>F2</kbd> and type in `update-manager -c -d` into the command box. * Update Manager should open up and tell you: New distribution release '20.04' is available. * If not, you can use `/usr/lib/ubuntu-release-upgrader/check-new-release-gtk` * Click "Upgrade" and follow the on-screen instructions.
fr: * Ouvrir "Logiciels et Mises à Jour" dans le Centre de Contrôle. * Sélectionner le 3ème onglet appelé "Mises à Jour". * Réglez le menu déroulant "Notifiez-moi d'une nouvelle version d'Ubuntu" sur "Pour les versions prises en charge sur le long terme" si vous utilisez Ubuntu 18.04 LTS; sur "Pour chaque nouvelle version" si vous utilisez 19.10. * Appuyez <kbd>Alt</kbd>+<kbd>F2</kbd> et entrez `update-manager -c -d` dans la boite de commande. * Le Gestionnaire de Mises à Jour devrait s'ouvrir et vous dire: La nouvelle version '20.04' de la distribution est disponible. * Si ce n'est pas le cas, vous pouvez utiliser `/usr/lib/ubuntu-release-upgrader/check-new-release-gtk` * Cliquez sur "Mettre à Niveau" et suivez les instructions à l'écran.

source: There are no offline upgrade options for Ubuntu MATE. Please ensure you have network connectivity to one of the official mirrors or to a locally accessible mirror and follow the instructions above.
fr: Il n'y a pas d'options de mise à niveau hors ligne pour Ubuntu MATE. Assurez-vous d'avoir une connexion réseau à l'un des miroirs officiels ou vers un miroir accessible localement et suivez les instructions ci-dessus.

source: ## Known Issues
fr: ## Problèmes Connus

source: Here are the known issues.
fr: Voici les problèmes connus.

source: * [Xorg crashes to Login prompt in VirtualMachines](https://bugs.launchpad.net/ubuntu/+source/xorg-server/+bug/1745345) * When `gstreamer-vaapi` is installed it will cause Xorg to crash and bring the user back to the login prompt when running certain applications. * See [Workaround for Xorg crashes to Login prompt in VirtualMachines 20.04](https://ubuntu-mate.community/t/workaround-for-xorg-crashes-to-login-prompt-in-virtualmachines-20-04/21368/2)
fr: * [Xorg plante et redirige vers une invite de connexion dans VirtualMachines](https://bugs.launchpad.net/ubuntu/+source/xorg-server/+bug/1745345) * Quand `gstreamer-vaapi` est installé, il provoquera le plantage de Xorg et redirigera l'utilisateur à l'invite de connexion lors de l'exécution de certaines applications. * Voir [La solution pour des plantages de Xorg ramenant à l'invite de connexion dans VirtualMachines 20.04](https://ubuntu-mate.community/t/workaround-for-xorg-crashes-to-login-prompt-in-virtualmachines-20-04/21368/2)

source: ### Ubuntu family issues
fr: ### Problèmes de la famille Ubuntu

source: This is our known list of bugs that affects all flavours.
fr: Ceci est notre liste de problèmes connus qui affectent toutes les variantes.

source: * [Ubiquity slide shows are missing for OEM installs of Ubuntu MATE and Ubuntu Budgie](https://pad.lv/1713720) * To work around this, run `apt install oem-config-slideshow-ubuntu-mate` in the OEM prepare session.
fr: * [Les diaporamas d'Ubiquity pour les installations OEM d'Ubuntu MATE et Ubuntu Budgie ne sont pas disponibles](https://pad.lv/1713720) * À titre de solution, exécutez `apt install oem-config-slideshow-ubuntu-mate` dans la session de préparation de l'OEM.

source: You'll also want to check the Ubuntu MATE bug tracker to see what has already been reported. These issues will be addressed in due course.
fr: Vous voudrez aussi jeter un œil au tracker de bugs d'Ubuntu MATE pour voir ce qui a déjà été rapporté. Ces problème seront réglés en temps voulu.

source: * [Ubuntu MATE Bug Tracker](https://bugs.launchpad.net/ubuntu-mate)
fr: * [Tracker de Bugs d'Ubuntu MATE](https://bugs.launchpad.net/ubuntu-mate)

source: ## Feedback
fr: ## Commentaires

source: Is there anything you can help with or want to be involved in? Maybe you just want to discuss your experiences or ask the maintainers some questions. Please [come and talk to us](https://ubuntu-mate.community/).
fr: Pourriez-vous nous aider de quelque façon que ce soit ou voudriez-vous vous impliquer ? Peut-être voudriez vous simplement discuter de vos expériences ou poser quelques questions aux mainteneurs. S'il-vous-plaît, [venez nous parler](https://ubuntu-mate.community/).
