Repository: ubuntu-mate/ubuntu-mate.org
Catalog: _i18n/*/2020-10-22-ubuntu-mate-groovy.po
Languages: ru

source: title: Ubuntu MATE 20.10 Release Notes description: What's new in Ubuntu MATE 20.10 (Groovy Gorilla)
ru: title: Примечания к выпуску Ubuntu MATE 20.10 description: Что нового в Ubuntu MATE 20.10 (Groovy Gorilla)

source: The releases following an LTS are always a good time ⌚ to make changes the set the future direction 🗺️ of the distribution with an eye on where we want to be for the next LTS release. Therefore, Ubuntu MATE 20.10 ships with that latest MATE Desktop 1.24.1, keeps paces with other developments within Ubuntu (such as Active Directory authentication) and migrated to the Ayatana Indicators project.
ru: Релизы, следующие за LTS всегда оказываются хорошим временем ⌚ для формирования списка изменений и будующих направлений 🗺️ развития дистрибутива с прицелом на то, где мы хотим оказаться для следующего LTS релиза. Таким образом, Ubuntu MATE 20.10 поставляется с последней версией рабочего стола MATE 1.24.1, идет в ногу со временем с другими разработками Ubuntu (такими как аутентификация через Active Directory) и перешел на проект Ayatana Indicators.

source: If you want bug fixes :bug:, kernel updates :corn:, a new web camera control :movie_camera:, and a new indicator :point_right: experience, then 20.10 is for you :tada:. Ubuntu MATE 20.10 will be supported for 9 months until July 2021. If you need Long Term Support, we recommend you use Ubuntu MATE 20.04 LTS.
ru: Если вы хотите получить исправления ошибок :bug:, обновление ядра :corn:, новую программу для управления веб-камерой :movie_camera:, и новый опыт использования индикаторов :point_right: , то 20.10 вам идеально подойдет :tada:. Версия Ubuntu MATE 20.10 будет поддерживаться 9 месяцев до июля 2021. Если вам нужна долгосрочная поддержка (Long Term Support), то мы рекомендуем вам использовать версию Ubuntu MATE 20.04 LTS.

source: Read on to learn more... :point_down:
ru: Читайте дальше, чтобы узнать больше... :point_down:

source: ## What's changed since Ubuntu MATE 20.04?
ru: ## Что изменилось относительно Ubuntu MATE 20.04?

source: ### MATE Desktop
ru: ### Рабочий стол MATE

source: If you follow the [Ubuntu MATE twitter account](https://twitter.com/ubuntu_mate) 🐦 you'll know that MATE Desktop 1.24.1 was recently released. Naturally Ubuntu MATE 20.10 features that maintenance release of MATE Desktop. In addition, [we have prepared updated MATE Desktop 1.24.1 packages for Ubuntu MATE 20.04](https://pad.lv/1891891) that are currently in the SRU process. Given the number of MATE packages being updated in 20.04, it might take some time ⏳ for all the updates to land, but we're hopeful that the fixes and improvements from MATE Desktop 1.24.1 will soon be available for those of you running 20.04 LTS 👍
ru: Если вы следите за обновлениями в [Twitter аккаунте Ubuntu MATE](https://twitter.com/ubuntu_mate) 🐦, то вы знаете что проект рабочего стола MATE недавно выпустил версию 1.24.1. Естественно, Ubuntu MATE 20.10 включает эту версию рабочего стола MATE. Дополнительно [мы подготовили пакеты обновления рабочего стола MATE версии 1.24.1 для Ubuntu MATE 20.04](https://pad.lv/1891891) в виде обновления для стабильной версии (SRU). На обновление пакетов MATE в 20.04 потребуется некоторое время ⏳, но мы надеемся, что исправления и улучшения из MATE Desktop 1.24.1 скоро будут доступны для тех из вас, кто использует 20.04 LTS 👍

source: The Ubuntu Desktop team added the option to enroll your computer into an Active Directory domain 🔑 during install. We've been tracking that work and the same capability is available in Ubuntu MATE too.
ru: Команда Ubuntu Desktop добавила возможность регистрации вашего компьютера в домене Active Directory 🔑 во время установки. Мы отслеживаем эту работу, поэтому такая же возможность доступна и в Ubuntu MATE.

source: {:.center} ![Active Directory Enrollment](/images/blog/groovy/active-directory.png) **Enroll your computer into an Active Directory domain**
ru: {:.center} ![регистрация в Active Directory](/images/blog/groovy/active-directory.png) **Регистрация вашего компьютера в домене Active Directory**

source: ### Ayatana Indicators
ru: ### Индикаторы Ayatana

source: There is a significant under the hood change 🔧 in Ubuntu MATE 20.10 that you might not even notice 👀 at a surface level; we've replaced Ubuntu Indicators with [Ayatana Indicators](https://github.com/AyatanaIndicators).
ru: В Ubuntu MATE 20.10 есть существенное скрытое изменение 🔧, которое вы можете даже не заметить 👀 на поверхностном уровне – мы заменили индикаторы Ubuntu на [индикаторы Ayatana](https://github.com/AyatanaIndicators).

source: We'll explain some of the background, why we've made this change, the short term impact and the long term benefits.
ru: Мы объясним некоторую предысторию, почему мы внесли это изменение, краткосрочное влияние и долгосрочные выгоды.

source: #### What are Ayatana Indicators?
ru: #### Что такое индикаторы Ayatana?

source: In short, Ayatana Indicators is a fork of Ubuntu Indicators that aims to be cross-distro compatible and re-usable for any desktop environment 👌 Indicators were developed by Canonical some years ago, initially for the GNOME2 implementation in Ubuntu and then refined for use in the Unity desktop. Ubuntu MATE has supported the Ubuntu Indicators for some years now and we've contributed patches to integrate MATE support into the suite of Ubuntu Indicators. Existing indicators are compatible with Ayatana Indicators.
ru: Короче говоря, Ayatana Indicators - это ответвление от Ubuntu Indicators, целью которого является совместимость между различными дистрибутивами и возможность повторного использования индикаторов в любых 👌 средах рабочего стола. Индикаторы были разработаны Canonical несколько лет назад первоначально для реализации GNOME2 в Ubuntu, а затем доработаны для использования на рабочем столе Unity. Ubuntu MATE уже несколько лет поддерживает индикаторы Ubuntu, и мы внесли патчи для интеграции поддержки MATE в набор индикаторов Ubuntu. Существующие индикаторы совместимы с индикаторами Ayatana.

source: We have migrated Ubuntu MATE 20.10 to Ayatana Indicators and Arctica Greeter. I live streamed 📡 the development work to switch from Ubuntu Indicators to Ayatana Indicators which you can find below if you're interested in some of the technical details 🤓
ru: Мы выполнили миграцию Ubuntu MATE 20.10 на использование индикаторов Ayatana и Arctica Greeter. Я трансировал в прямом эфире 📡 процесс перехода от индикаторов Ubuntu к индикаторам Ayatana, который вы можете найти ниже, если вас интересуют некоторые технические детали 🤓

source: #### The benefits of Ayatana Indicators
ru: #### Преимущества использования индикаторов Ayatana

source: Ubuntu MATE 20.10 is our first release to feature Ayatana Indicators and as such there are a couple of drawbacks; there is no messages indicator and no graphical tool to configure the display manager greeter (login window) 😞
ru: Ubuntu MATE 20.10 - это наш первый выпуск, в котором есть индикаторы Ayatana, и поэтому у него есть несколько мелких недостатков: нет индикатора сообщений и графического инструмента для настройки приветствия диспетчера дисплеев (окна входа в систему) 😞

source: Both will return in a future release and the greeter can be configured using `dconf-editor` in the meantime.
ru: Оба вернутся в будущем выпуске, а сейчас окно приветствия можно настроить используя `dconf-editor`.

source: {:.center} ![Arctica Greeter dconf configuration](/images/blog/groovy/arctica-greeter-dconf.png) **Configuring Arctica Greeter with `dconf-editor`**
ru: {:.center} ![Настройка Arctica Greeter через dconf](/images/blog/groovy/arctica-greeter-dconf.png) **Настройка Arctica Greeter через `dconf-editor`**

source: That said, there are significant benefits that result from migrating to Ayatana Indicators:
ru: Тем не менее, переход на индикаторы Ayatana дает значительные преимущества:

source: * Debian and Ubuntu MATE are now aligned with regards to Indicator support; patches are no longer required in Ubuntu MATE which reduces the maintenance overhead. * [MATE Tweak](https://github.com/ubuntu-mate/mate-tweak) is now a cross-distro application, without the need for distro specific patches. * We've switched from [Slick Greeter](https://github.com/linuxmint/slick-greeter) to [Arctica Greeter](https://github.com/ArcticaProject/arctica-greeter) (both forks of Unity Greeter) * Arctica Greeter integrates completely with Ayatana Indicators; so there is now a consistent Indicator experience in the greeter and desktop environment. * Multiple projects are now using Ayatana Indicators, including desktop environments, distros and even mobile phone projects such as [UBports](https://ubports.com/). With more developers collaborating in one place we are seeing the collection of available indicators grow 📈 * Through UBports contributions to Ayatana Indicators we will soon have a Bluetooth indicator that can replace Blueman, providing a much simpler way to connect and manage Bluetooth devices. UBports have also been working on a network indicator and we hope to consolidate that to provide improved network management as well. * Other indicators that are being worked on include printers, accessibility, keyboard (long absent from Ubuntu MATE), webmail and display.
ru: * Debian и Ubuntu MATE теперь согласованы в отношении поддержки индикаторов; патчи больше не требуются в Ubuntu MATE, что снижает накладные расходы на обслуживание. * [MATE Tweak](https://github.com/ubuntu-mate/mate-tweak) теперь является кросс-дистрибутивным приложением, без необходимости установки патчей для конкретных дистрибутивов. * Вместо [Slick Greeter](https://github.com/linuxmint/slick-greeter) мы стали использовать [Arctica Greeter](https://github.com/ArcticaProject/arctica-greeter) (оба являются ответвлениями Unity Greeter) * Arctica Greeter полностью интегрирован с индикаторами Ayatana; поэтому теперь индикаторы на экране приветствия и рабочем столе выглядят одинаково. * Множество проектов используют индикаторы Ayatana в настоящее время, включая различные среды рабочего стола, дистрибутивы и даже проект для мобильных телефонов [UBports](https://ubports.com/). Поскольку все больше разработчиков работают в одном месте, мы наблюдаем рост набора доступных индикаторов. 📈 * Благодаря вкладу UBports в индикаторы Ayatana у нас скоро появится индикатор Bluetooth, который может заменить Blueman, обеспечивая гораздо более простой способ подключения и управления устройствами Bluetooth. UBports также работает над индикатором сети, и мы надеемся внедрить его, чтобы улучшить управление сетью.. * Другие индикаторы, над которыми ведется работа, включают принтеры, специальные возможности, клавиатуру (давно отсутствующую в Ubuntu MATE), веб-почту и дисплей.

source: So, that is the backstory about how developers from different projects come together to collaborate on a shared interest and improve software for their users 💪
ru: Итак, это предыстория того, как разработчики из разных проектов объединяются, чтобы сотрудничать, имея общие интересы, и улучшать программное обеспечение для своих пользователей 💪.

source: We've replaced Cheese :cheese: with Webcamoid :movie_camera: as the default webcam tool for several reasons.
ru: Мы заменили предустановленную программу Cheese :cheese: на Webcamoid :movie_camera: для работы с веб-камерами по следующим причинам.

source: * Webcamoid is a full webcam/capture configuration tool with recording, overlays and more, unlike Cheese. While there were initial concerns :pensive:, since Webcamoid is a Qt5 app, nearly all the requirements in the image are pulled in via YouTube-DL :tada:. * We've disabled notifications :bell: for Webcamoid updates if installed from universe pocket as a deb-version, since this would cause errors in the user's system and force them to download a non-deb version. This only affects users who don't have an existing Webcamoid configuration.
ru: * Webcamoid - это полноценный инструмент настройки веб-камеры/видеозахвата с записью, наложениями и многим другим, в отличие от Cheese. Хотя изначально у нас были опасения :pensive:, поскольку Webcamoid - это приложение Qt5, но оказалось, что почти все зависимости уже были установлены из-за YouTube-DL :tada:. * Мы отключили уведомления :bell: о наличии обновлений Webcamoid, если он установлен из репозитория universe в виде deb-пакета, так как это вызовет ошибки в системе пользователя и заставит его загрузить версию, отличную от deb. Это применяется только для тех пользователей, у которых нет существующей конфигурации Webcamoid.

source: ### Linux Kernel
ru: ### Ядро Linux

source: Ubuntu MATE 20.10 includes the 5.8 Linux kernel. This includes numerous updates and added support since the 5.4 Linux kernel released in Ubuntu 20.04 LTS. Some notable examples include:
ru: Ubuntu MATE 20.10 включает ядро Linux версии 5.8. Оно включает множество обновлений и доблений относительно версии 5.4, включенной в версию Ubuntu 20.04 LTS. Вот некоторые заметные изменения:

source: * Airtime Queue limits for better WiFi connection quality * Btrfs RAID1 with 3 and 4 copies and more checksum alternatives * USB 4 (Thunderbolt 3 protocol) support added * X86 Enable 5-level paging support by default * Intel Gen11 (Ice Lake) and Gen12 (Tiger Lake) graphics support * Initial support for AMD Family 19h (Zen 3) * Thermal pressure tracking for systems for better task placement wrt CPU core * XFS online repair * OverlayFS pairing with VirtIO-FS * General Notification Queue for key/keyring notification, mount changes, etc. * Active State Power Management (ASPM) for improved power savings of PCIe-to-PCI devices * Initial support for POWER10
ru: * Очереди эфирного времени (Airtime Queue limits) для лучшего качества WiFi-соединений * Поддержка RAID1 с 3 и 4 копиями для Btrfs и большим набором используемых алгоритмов расчета контрольных сумм * Поддержка USB 4 (протокол Thunderbolt 3) добавлена * По умолчанию задействована возможность пятиуровневых таблиц страниц памяти для X86 * Поддердка графики Intel Gen11 (Ice Lake) и Gen12 (Tiger Lake) * Первоначальная поддержка для AMD Family 19h (Zen 3) * Отслеживание температурного давления для систем для лучшего размещения задач по отношению к ядру процессора * Восстановление XFS в режиме онлайн * Объединение OverlayFS с VirtIO-FS * Общая очередь уведомлений (General Notification Queue) для уведомлений о изменениях значений, точек монтирования и др. * Active State Power Management (ASPM) для устройств PCIe-в-PCI * Первоначальная поддержка POWER10

source: ## Raspberry Pi images
ru: ## Образы для Raspberry Pi

source: We have been preparing Ubuntu MATE 20.04 images for the Raspberry Pi and we will be release final image for 20.04 and 20.10 in the coming days 🙂
ru: Мы готовили образы Ubuntu MATE 20.04 для Raspberry Pi и в ближайшие дни мы выпустим финальные образы для 20.04 и 20.10 🙂

source: ## Major Applications
ru: ## Основные программы

source: Accompanying **MATE Desktop 1.24.1** and **Linux 5.8** are **Firefox 81**, **LibreOffice 7.0.2**, **Evolution 3.38** & **Celluloid 0.18**.
ru: Дополнительно к **рабочему столу MATE версии 1.24.1** и **ядру Linux версии 5.8** дистрибутив включает **Firefox 81**, **LibreOffice 7.0.2**, **Evolution 3.38** и **Celluloid 0.18**.

source: {:.center} ![Major Applications](/images/blog/groovy/versions.png)
ru: {:.center} ![Основные программы](/images/blog/groovy/versions.png)

source: See the [Ubuntu 20.10 Release Notes](https://discourse.ubuntu.com/t/groovy-gorilla-release-notes/15533) for details of all the changes and improvements that Ubuntu MATE benefits from.
ru: Смотрите [примечания к выпуску Ubuntu 20.10](https://discourse.ubuntu.com/t/groovy-gorilla-release-notes/15533) для получения подробной информации обо всех изменениях и улучшениях в Ubuntu, от которых выигрывает Ubuntu MATE.

source: ## Upgrading from Ubuntu MATE 20.04 LTS
ru: ## Обновление с версии Ubuntu MATE 20.04 LTS

source: You can upgrade to Ubuntu MATE 20.10 from Ubuntu MATE 20.04 LTS. Ensure that you have all updates installed for your current version of Ubuntu MATE before you upgrade.
ru: Вы можете обновиться до Ubuntu MATE 20.10 с версии Ubuntu MATE 20.04 LTS. Убедитесь, что вы установили все необходимые обновления для вашей текущей версии Ubuntu MATE перед обновлением.

source: * Open the "Software & Updates" from the Control Center. * Select the 3rd Tab called "Updates". * Set the "Notify me of a new Ubuntu version" drop down menu to "For any new version". * Press <kbd>Alt</kbd>+<kbd>F2</kbd> and type in `update-manager -c -d` into the command box. * Update Manager should open up and tell you: New distribution release 'XX.XX' is available. * If not, you can use `/usr/lib/ubuntu-release-upgrader/check-new-release-gtk` * Click "Upgrade" and follow the on-screen instructions.
ru: * Откройте "Программы и обновления" из Центра управления. * Переключитесь на третью вкладку с именем "Обновления". * В выпадающем списке "Уведомлять меня о выходе новой версии Ubuntu" выберите опцию "При доступности любой новой версии". * Нажмите сочетание клавиш <kbd>Alt</kbd>+<kbd>F2</kbd> и введите команду `update-manager -c` в текстовом поле. * Должно открыться окно Обновление приложений и вывести сообщение: Доступен выпуск Ubuntu '20.10'. * Если нет, вы можете воспользоваться командой `/usr/lib/ubuntu-release-upgrader/check-new-release-gtk` * Нажмите "Обновить" и следуйте инструкциям на экране.

source: There are no offline upgrade options for Ubuntu MATE. Please ensure you have network connectivity to one of the official mirrors or to a locally accessible mirror and follow the instructions above.
ru: Для Ubuntu MATE нет вариантов автономного обновления. Убедитесь, что у вас есть сетевое подключение к одному из официальных зеркал или к локально доступному зеркалу, и следуйте приведенным выше инструкциям.

source: ## Known Issues
ru: ## Известные проблемы

source: Here are the known issues.
ru: Ниже представлен список известных нам проблем.

source: ## Feedback
ru: ## Обратная связь

source: Is there anything you can help with or want to be involved in? Maybe you just want to discuss your experiences or ask the maintainers some questions. Please [come and talk to us](https://ubuntu-mate.community/).
ru: Есть ли что-нибудь, в чем вы можете помочь или чем хотите принять участие? Может быть, вы просто хотите обсудить свой опыт или задать несколько вопросов сопровождающим? Пожалуйста [приходите и поговорите с нами](https://ubuntu-mate.community/).
