Repository: ubuntu-mate/ubuntu-mate.org
Catalog: _i18n/*/faq-verify-secure.po
Languages: fr

source: title: Verifying Downloads
fr: title: Vérifier les Téléchargements

source: ## Verify for Tampering
fr: ## Vérifier pour le sabotage

source: This method will verify the signature on the `SHA256SUMS` checksum file. By proving that this file's digital signature belongs to Ubuntu, you can be confident using these checksums to verify the downloaded files haven't been tampered or corrupted.
fr: Cette méthode vérifiera la signature du fichier de somme de contrôle `SHA256SUMS`. En prouvant que la signature digitale du fichier appartient à Ubuntu, vous pouvez en toute confiance utiliser ces sommes de contrôle pour vérifier que les fichiers téléchargés n'ont pas été sabotés ou corrompus.

source: ## Preperations
fr: ## Préparations

source: We recommend using the [Windows Subsystem for Linux (WSL)](https://docs.microsoft.com/en-us/windows/wsl/faq), which allows you to run Ubuntu within Windows. This will provide a GNU/Linux environment for running GPG and checksum commands.
fr: Nous vous recommandons d'utiliser le [Sous-système Windows pour Linux (WSL)](https://docs.microsoft.com/en-us/windows/wsl/faq), qui vous permet d'exécuter Ubuntu sous Windows. Cela vous fournira un environnement GNU/Linux pour exécuter des commandes GPG et de contrôle de somme.

source: For help setting up this environment, please see:
fr: Pour de l'aide pour l'installation de cet environnement, veuillez voir:

# pages/faq-verify-secure.md:35
source: Once installed, jump to the [steps](#steps) section.
fr: Une fois installé, allez à la section [étapes](#étapes).

source: You'll need to install GnuPG (utility for verifying the signature) and `sha256sum` (for verifying the checksum). We recommend installing this via [Homebrew](https://brew.sh/), a command line package manager for macOS.
fr: Vous devez installer GnuPG (utilitaire pour vérifier la signature) et `sha256sum` (pour vérifier la somme de contrôle). Nous vous recommandons d'installer cela par [Homebrew](https://brew.sh/), un gestionnaire de paquets en ligne de commande pour macOS.

source: 1. Install: <https://brew.sh/> 2. Run:
fr: 1. Installez: <https://brew.sh/> 2. Exécutez:

# pages/faq-verify-secure.md:50
source: Once installed, jump to the [steps](#steps) section.
fr: Une fois installé, allez à la section [étapes](#étapes).

source: Most, if not all, distros (including Ubuntu MATE) comes preloaded with packages that provide `gnupg` and `sha256sum`. If yours doesn't, you can install these via your distro's package manager.
fr: La plupart - voire toutes - les distros (y compris Ubuntu MATE) sont offertes avec des paquets préchargés qui fournissent `gnupg` et `sha256sum`. Si ce n'est pas le cas de la vôtre, vous pouvez installer ces paquets par le gestionnaire de paquets de votre distro.

source: In Ubuntu, `sha256sum` is provided in `coreutils`.
fr: Dans Ubuntu, `sha256sum` est fourni avec `coreutils`.

source: ## Steps
fr: ## Étapes

source: ### 1. Obtain the checksums and signature
fr: ### 1. Obtenir les sommes de contrôle et la signature

source: For downloads provided by Canonical:
fr: Pour les téléchargements fournis par Canonical:

source: * <http://cdimages.ubuntu.com/ubuntu-mate/releases/> * Download the `SHA256SUM` and `SHA256SUM.gpg` files.
fr: * <http://cdimages.ubuntu.com/ubuntu-mate/releases/> * Téléchargez les fichiers `SHA256SUM` et `SHA256SUM.gpg`.

source: > > **Canonical's download server is HTTP! Is this secure?** > > This is a question that commonly asked. We use Canonical's infrastructure > being an official Ubuntu flavour. Many archive mirrors do not use > SSL to reduce the overhead of HTTPS. > > The GPG fingerprint is validated against the Ubuntu keyserver. > So, regardless of where you obtained the file, if the signature matches, > you can trust the file. >
fr: > > **Le serveur de téléchargement de Canonical est en HTTP ! Est-ce sécurisé ?** > > C'est une question fréquemment posée. Nous utilisons l'infrastructure de Canonical > étant une variante officielle d'Ubuntu. Bien des miroirs d'archives n'utilisent pas > le SSL pour réduire la surcharge de l'HTTPS. > > L'empreinte digitale GPG est validée contre la clé de serveur d'Ubuntu. > Alors, peu importe où vous avez obtenu le fichier, si les signatures coïncident, >Vous pouvez faire confiance au fichier. >

source: Or for device ports provided by us:
fr: Ou pour les portages d'appareil fournis par nous:

source: * <https://releases.ubuntu-mate.org> * Download the `.sha256` and `.sha256.sign` files.
fr: * <https://releases.ubuntu-mate.org> * Téléchargez les fichiers `.sha256` et `.sha256.sign`.

source: First, let's find out if you have the signature key:
fr: Tout d'abord, voyons voir si vous disposez de la clé de signature:

# pages/faq-verify-secure.md:92
source: Or:
fr: Ou:

source: If this says:
fr: SI cela dit:

source: If you don't have the public key, see **step 2**, otherwise skip to **step 3**.
fr: Si vous n'avez pas la clé publique, voir **étape 2**, sinon passez à l'**étape 3**.

source: ### 2. Retrieve the key (if applicable)
fr: ### 2. Récupérez la clé (si applicable)

source: Here's how to securely download the signature key from the keyserver. This only needs to be performed once, except in the rare situation the keys were updated.
fr: Voici comment télécharger la clé de signature à partir du serveur de clé de façon sécurisée. Cela doit être fait une seule fois sauf si d'aventure, les clés étaient mises à jour.

source: In this instance, the two keys are `46181433FBB75451` and `D94AA3F0EFE21092`. Run this command, but add `0x` to the start of both these keys, like so:
fr: Dans cet exemple, les deux clés sont `46181433FBB75451` et `D94AA3F0EFE21092`. Exécutez cette commande, mais ajoutez `0x` au début de ces clés, comme ceci:

source: You should get an output like this:
fr: Vous devriez avoir une sortie comme celle-ci:

# pages/faq-verify-secure.md:141
source: Or:
fr: Ou:

source: Suspicions should arise if the public key belongs to a random stranger, or looks forged.
fr: La suspicion est de mise si la clé publique appartient à un parfait inconnu, ou si elle paraît fausse.

source: ### 3. Is it a match?
fr: ### 3. Cela correspond-il ?

source: Run this command:
fr: Exécutez cette commande:

source: And the output:
fr: Et la sortie:

source: Note the **bold** lines which confirm the file was signed by the team over at Ubuntu. If this wasn't genuine, the result would be **BAD signature**.
fr: Notez les lignes en **gras** qui confirment que le fichier a été signé par l'équipe d'Ubuntu. Si ce n'était pas véritable, le résultat serait **MAUVAISe signature**.

source: The "key is not certified" message is simply because you haven't explictly told GnuPG to trust this key. This is optional. You can [learn more about GnuPG on the wiki page](https://help.ubuntu.com/community/GnuPrivacyGuardHowto).
fr: Le message "clé non certifiée" apparaît simplement car vous n'avez pas explicitement dit à GnuPG de lui faire confiance. C'est optionnel. Vous pouvez [en savoir plus à propos de GnuPG sur la page wiki](https://help.ubuntu.com/community/GnuPrivacyGuardHowto).

source: ### 4. Verify the ISOs
fr: ### 4. Vérifier les ISOs

source: Now we know the checksum file is untampered with, you can proceed to verify for corruption as normal.
fr: Maintenant que nous savons que le fichier de somme de contrôle n'a pas été saboté, vous pouvez enchaîner avec la vérification pour la corruption comme d'habitude.

source: You should see "OK" in its output:
fr: Vous devriez voir "OK" dans sa sortie:

source: An empty output would indicate the file is corrupt and should re-downloaded again.
fr: Une sortie vide signifierait que le fichier est corrompu et devrait être téléchargé à nouveau.

source: There are other ways to perform checksum checks that don't require a Terminal, take a look at our [Verify for corruption](/faq/verify-download-quick/) for details.
fr: Il y a d'autres manières de réaliser une vérification des sommes de contrôle qui ne requièrent pas un terminal, jetez un œil à notre page [Vérifier pour la corruption](/faq/verify-download-quick/) pour plus de détails.

source: _This page is an adaptation of [Ubuntu's verification tutorial](https://discourse.ubuntu.com/t/14010)._
fr: _Cette page est une adaptation du [tutoriel de vérification d'Ubuntu](https://discourse.ubuntu.com/t/14010)._
