Repository: ubuntu-mate/ubuntu-mate.org
Catalog: _i18n/*/faq-verify-quick.po
Languages: fr

source: title: Verifying Downloads
fr: title: Vérifier les Téléchargements

source: ## Verify for Corruption
fr: ## Vérifiez pour la corruption

source: A checksum is a string of letters and numbers that is unique to a file, like a fingerprint. Checksums are generated by different algorithms, with the two most popular being **Secure Hash Algorithms (SHAs)** and the **MD5** algorithm. Ubuntu MATE provides the **SHA256** checksum on its [download](/download/) page.
fr: Une somme de contrôle est une chaîne de lettres et de nombres qui sont uniques à un fichier, comme une empreinte digitale. Les sommes de contrôle sont générées par différents algorithmes, les deux plus populaires étant les algorithmes **Secure Hash Algorithms (SHAs)** et **MD5**. Ubuntu MATE fournit la somme de contrôle en **SHA256** sur sa page de [téléchargement](/download/).

source: Verifying a download involves checking the checksum of the file you downloaded *versus* the checksum provided on the download web site. Mismatching checksums can indicate a corrupted or otherwise compromised file, so verifying your downloads is a good habit to adopt!
fr: Vérifier un téléchargement implique de comparer la somme de contrôle du fichier que vous avez téléchargé avec la somme de contrôle fournie sur le site web du téléchargement. Des sommes de contrôles différentes peuvent indiquer un téléchargement corrompu ou un fichier compromis, alors vérifier vos téléchargements est une bonne habitude à prendre.

source: As an alternate, you can check your downloaded is trustworthy, by [verifying the digital signature](/faq/verify-download-secure/) of the file instead.
fr: Par ailleurs, vous pouvez également vous assurer que votre téléchargement est digne de confiance en [vérifiant la signature digitale](/faq/verify-download-secure/) du fichier.

source: This method uses a third-party application named **MD5 & SHA Checksum Utility**.
fr: Cette méthode utilise une application de tierce-partie appelée **MD5 & SHA Checksum Utility**.

source: * Download [MD5 & SHA Checksum Utility](https://raylin.wordpress.com/downloads/md5-sha-1-checksum-utility/) * Launch the application *MD5_and_SHA_Checksum_Utility.exe* * Click on the **Browse** button and browse to the *Ubuntu MATE* ISO file.
fr: * Téléchargez [MD5 & SHA Checksum Utility](https://raylin.wordpress.com/downloads/md5-sha-1-checksum-utility/) * Lancez l'application *MD5_and_SHA_Checksum_Utility.exe* * Cliquez sur le bouton **Parcourir** et naviguez vers le fichier ISO *Ubuntu MATE*.

source: ![MD5 and SHA Checksum](/images/faq/verify/MD5_and_SHA_Checksum_Utility.png)
fr: ![Sommes de contrôle MD5 et SHA](/images/faq/verify/MD5_and_SHA_Checksum_Utility.png)

source: **Note:** To make calculation faster, it's only necessary to check the checksums you have values for.
fr: **Note:** Afin d'accélérer les calculs, pensez à ne cocher que les sommes de contrôle pour lesquelles vous avez des valeurs.

source: On macOS, you can verify checksums easily and manually in the command line, as `shasum` comes preinstalled.
fr: Sur macOS, vous pouvez facilement vérifier les sommes de contrôle de manière manuelle par ligne de commande puisque `shasum` est pré-installé.

source: * Open a **Terminal** window and a **Finder** window containing the ISO. * Type `shasum -a 256` and drag the ISO's file icon into **Terminal**.
fr: * Ouvrez une fenêtre de **Terminal** et une fenêtre de **Finder** contenant l'ISO. * Tapez `shasum -a 256` et glissez l'icône du fichier ISO sur le **Terminal**.

source: * Press **Enter** to begin the process. This may take a few moments. * Compare the SHA256 checksum printed to the command line to the checksum on the image's download page.
fr: * Appuyez sur **Entrée** pour démarrer le processus. Cela peut prendre quelques instants. * Comparez la somme de contrôle SHA256 affichée en ligne de commande avec la somme de contrôle de la page de téléchargement de l'image..

source: This application can be installed via your distribution's software manager, if it is not already installed.
fr: Cette application peut être installée par le gestionnaire de paquets de votre distribution, si elle n'est pas déjà installée.

source: * Launch `gtkhash` * In the **File** dropdown menu, select the ISO you wish to check * On the page where you downloaded the ISO, copy the SHA256 checksum and paste into the **Check** field * Click **Hash** - a green checkmark means the image is verified
fr: * Lancez `gtkhash` * Dans le menu déroulant **Fichier**, sélectionnez l'image ISO que vous souhaitez vérifier * Sur la page où vous avez téléchargé l'ISO, copiez la somme de contrôle SHA256 et collez-la dans le champ **Vérifier** * Cliquez sur **Hash** - un crochet vert signifie que l'image est vérifiée.

source: #### Command Line
fr: #### Ligne de Commande

source: On every distribution, you have command line tools for verifying checksums. In this case, we're interested in the `sha256sum` tool.
fr: Sur toutes les distributions, vous avez des outils en ligne de commande pour vérifier les sommes de contrôle. Dans le cas présent, nous allons nous intéresser à l'outil `sha256sum`.

source: * First, switch to the directory where the ISO is stored * Enter `sha256sum ubuntu-mate-XX.XX-version.iso`, substituting the name of the specific ISO you downloaded. * Compare the SHA256 checksum printed to the command line to the checksum on the download page.
fr: * En premier lieu, basculez dans le répertoire où l'ISO est stockée * Entrez `sha256sum ubuntu-mate-XX.XX-version.iso`, en substituant le nom de l'ISO spécifique que vous avez téléchargée.. * Comparez la somme de contrôle SHA256 affichée en ligne de commande à celle de la page de téléchargement.

source: On current Ubuntu MATE versions (18.04 LTS and newer), `caja-gtkhash` is pre-installed and allows you to perform checksums from within the file browser.
fr: Dans les versions actuelles d'Ubuntu MATE (18.04 LTS et suivantes), `caja-gtkhash` est pré-installé et vous permet de vérifier des sommes de contrôle avec le gestionnaire de fichiers.

source: * Navigate to the file in the Caja file manager. * Right click the file and choose **Properties**. * Open the **Digests** tab. * Copy the SHA256SUM checksum from the download page and paste into **Check** field. The green check mark means the download is verified.
fr: * Naviguez jusqu'au fichier dans le gestionnaire de fichiers Caja. * Effectuez un clic droit sur le fichier et choisissez **Propriétés**. * Cliquez sur l'onglet **Empreintes**. * Copiez la somme de contrôle SHA256SUM de la page de téléchargement et collez-la dans le champ **Vérifier**. Un crochet vert signifie que le téléchargement est vérifié.

source: ![Check SHA256 Hash](/images/faq/verify/Check-SHA256-Hash.png)
fr: ![Vérifier le Hash SHA256](/images/faq/verify/Check-SHA256-Hash.png)
