Repository: ubuntu-mate/ubuntu-mate.org
Catalog: _i18n/*/get-involved-crowdfund.po
Languages: fr

source: title: Crowd Funding
fr: title: Financement Participatif

source: ## Crowd Funding
fr: ## Financement Participatif

source: Did you know one of the most important contributions you can make to Ubuntu MATE doesn't require a single line of code? Like many open source projects, community financial support not only helps keep the virtual lights on, but funds improvements to Ubuntu MATE, the MATE Desktop, and numerous other Open Source projects.
fr: Saviez-vous que l'une des contributions les plus importantes que vous puissiez faire au projet Ubuntu MATE ne requiert pas la moindre ligne de code ? Comme de nombreux projets open source, le support financier de la communauté nous aide à maintenir les lumières virtuelles en marche, mais finance les améliorations d'Ubuntu MATE, du Bureau MATE, et de nombreux autres projets Open Source.

source: Between 2014 and 2017, your generosity helped pay for:
fr: Entre 2014 et 2017, votre générosité nous a aidé à financer:

source: * Welcome and Software Boutique * Ambiant and Radiant Themes * Brisk Menu * Accessibility fixes and improvements
fr: * Bienvenue et Boutique de Logiciels * Thèmes Ambiant et Radiant * Menu Brisk * Corrections d'accessibilité et améliorations

source: ### MATE Desktop
fr: ### Bureau MATE

source: * Reviewing and sponsoring uploads to Debian * Development and packaging in Debian * GTK3 migrating and porting * MATE Menu * MATE Dock * [Engrampa](https://github.com/mate-desktop/engrampa) * Development and packaging for Fedora and Linux Mint
fr: * Passer en revue et sponsoriser les envois sur Debian * Développement et paquets Debian * Migration et portage GTK3 * Menu MATE * Dock MATE * [Engrampa](https://github.com/mate-desktop/engrampa) * Développement et paquets pour Fedora et Linux Mint

source: ### Open Source Projects
fr: ### Projets Open Source

source: ## Spreading the Word
fr: ## Passer le Mot

source: * MicroSD cards and memory sticks flashed with Ubuntu MATE to distribute at Raspberry Pi Jams * Raspberry Pis, ODROIDs, and a secondhand iBook G4 for development of specific Ubuntu MATE images * Dedicated servers * Prizes for community competitors * Getting Wimpy to UbuCon Europe 2016 * A reasonably-priced beverage to celebrate the release of 15.10 :wine_glass:
fr: * Cartes MicroSD et clés USB flashées avec Ubuntu MATE à distribuer aux Raspberry Pi Jams * Raspberry Pis, ODROIDs, et un iBook G4 d'occasion pour le développement d'images spécifiques d'Ubuntu MATE * Serveurs dédiés * Prix pour des compétiteurs de la communauté *Permettre à Wimpy d'aller à l'UbuCon Europe 2016 * Une boisson à tarif raisonnable pour célébrer la sortie de 15.10 :wine_glass:

source: To show how a small donation can go a long way, let's look at how we funded two Raspberry Pi 3's for development, costing £62.90 each. This breaks down to:
fr: Pour vous montrer comment une infime donation peut aller loin, jetons un œil aux financements de nos deux Raspberry Pi 3 pour le développement, coûtant 62.90£ chacun. Cela revient à:

source: * 32 donations of £2, or * 13 donations of £5, or * 7 donations of £10 _(all with a little change to spare)_
fr: * 32 donations de 2£, or * 13 donations de 5£, or * 7 donations de 10£ _(avec de la petite monnaie à économiser)_

source: In short, :relieved: + :dollar: :pound: :euro: :credit_card: = :green_heart:
fr: En bref, :relieved: + :dollar: :pound: :euro: :credit_card: = :green_heart:

source: So if you want to help grow our community and keep Ubuntu MATE amazing, head over to our funding page and find out how you can help!
fr: Alors, si vous souhaitez aider à faire grandir notre communauté et conserver un formidable Ubuntu MATE, dirigez-vous vers notre page de financement et découvrez comment nous aider !

source: [View Funding Options](/funding/){:.btn .green}
fr: [Afficher les Options de Financement](/funding/){:.btn .green}
