Repository: ubuntu-mate/ubuntu-mate.org
Catalog: _i18n/*/ports-raspberry-pi-change-log.po
Languages: fr, ru

source: title: Raspberry Pi Changes
fr: title: Changements Raspberry Pi
ru: title: изменения для Raspberry Pi

source: # What's New for the Raspberry Pi?
fr: # Quoi de Neuf pour le Raspberry Pi?
ru: # Что нового для Raspberry Pi?

source: [See the Raspberry Pi page for latest developments.](/ports/raspberry-pi/)
fr: [Voir la page du Raspberry Pi pour les derniers développements.](/ports/raspberry-pi/)
ru: [Посмотрите страницу новейших изменений для Raspberry Pi.](/ports/raspberry-pi/)

source: ### Ubuntu MATE 18.04.2 Beta 2 - WIP
ru: ### Ubuntu MATE 18.04.2 Beta 2 - в разработке

source: * Added Raspberry Pi specific applications to the Software Boutique. * Minecraft: Pi Edition * Steam Link * Disabled WiFi Power Management. * `openssh-server` no longer pre-installed.
fr: * Ajouté des applications spécifiques au Raspberry Pi dans la Boutique de Logiciels. * Minecraft: Pi Edition * Steam Link * Désactivé la Gestion de l'Alimentation du WiFi. * `openssh-server` n'est plus pré-installé.
ru: * Добавлены специфичные для Raspberry Pi приложения в Магазин программного обеспечения (Software Boutique). * Minecraft: Pi Edition * Steam Link * Выключено управление питанием WiFi. * Сервер `openssh-server` больше не предустанавливается.

source: ### Ubuntu MATE 18.04.2 Beta 1 - March 24th, 2019
fr: ### Ubuntu MATE 18.04.2 Beta 1 - 24 Mars 2019
ru: ### Ubuntu MATE 18.04.2 Beta 1 - 24 марта 2019

source: * Fixed EGL/GLES/OpenVG libraries for VideoCore IV. * Fixed Raspberry Pi features in Ubuntu MATE Welcome. * Added hardware accelerated VLC (`armhf` only). * Added hardware accelerated ffmpeg (`armhf` only). * Enabled piwheels. * Reduced boot time, after the initial first boot setup has been completed, by ~3 seconds. * Uploaded SteamLink (`armhf` only) to the archive, not pre-installed. * Uploaded Minecraft Pi Edition (`armhf` only) to the archive, not pre-installed. * Raspberry Pi 3 Model A+ confirmed working, *kind of*.
fr: * Corrigé les bibliothèques EGL/GLES/OpenVG pour VideoCore IV. * Corrigé les fonctionnalités Pi dans Ubuntu MATE Bienvenue. * Ajouté l'accélération matérielle dans VLC (seulement pour `armhf`). * Ajouté l'accélération matérielle dans ffmpeg (seulement pour `armhf`). * Activé piwheels. * Réduit le temps de démarrage de ~3 secondes, après la mise en route initiale lors du premier démarrage. * Téléversé SteamLink (seulement pour `armhf`) dans l'archive, n'est pas pré-installé. * Téléversé Minecraft Pi Edition (seulement pour `armhf`) dans l'archive, n'est pas pré-installé. * Confirmation que le Raspberry Pi 3 Model A+ fonctionne "plus ou moins".
ru: * Исправлены библиотеки EGL/GLES/OpenVG для VideoCore IV. * Исправлены возможности Raspberry Pi для Ubuntu MATE Welcome. * Добавлено аппаратное ускорение в VLC (только для `armhf`). * Добавлено аппаратное ускорение в ffmpeg (только для `armhf`). * Включены piwheels. * Уменьшено время загрузки после завершения мастера первоначальной настройки, примерно на ~3 секунды. * Выгружен SteamLink в архив (только для `armhf`), не предустановлен. * Выгружен Minecraft Pi Edition в архив (только для `armhf`), не предустановлен. * Подтверждена работа платы Raspberry Pi 3 Model A+, *почти*.

source: ### Ubuntu MATE 18.04.2 - March 5th, 2019
fr: ### Ubuntu MATE 18.04.2 - 5 Mars 2019
ru: ### Ubuntu MATE 18.04.2 - 5 марта 2019

source: * Fixed HDMI audio quality. * Fixed USB booting. * Fixed font caches. * Added pre-seeded snaps. * Added miscellaneous Raspberry Pi utilities. * Added EGL/GLES/OpenVG libraries for VideoCore IV. * Enabled splash screen. * Improved window manager responsiveness. * Reduced idle RAM consumption by ~30MB on arm64 and ~10MB on armhf. * Switched to the CFQ scheduler.
fr: * Corrigé la qualité audio HDMI. * Corrigé le démarrage par USB. * Corrigé les caches de police. * Ajouté des snaps pré-sélectionnés. * Ajouté divers utilitaires pour Raspberry Pi. * Ajouté les bibliothèques EGL/GLES/OpenVG pour VideoCore IV. * Ajouté l'écran de démarrage. * Amélioré la responsivité du gestionnaire de fenêtres. * Réduit la consommation de RAM de ~30MO sur arm64 et ~10MO sur armhf. * Changé pour le planificateur CFQ.
ru: * Улучшено качество звука через HDMI. * Исправлена загрузка с USB. * Исправлены кэши шрифтов. * Добавлены предустановленные snaps. * Добавлены различные утилиты для Raspberry Pi. * Добавлены библиотеки EGL/GLES/OpenVG для VideoCore IV. * Включена экранная заставка. * Улучшена отзывчивость оконного менеджера. * Уменьшено потребление оперативной памяти в простое - на ~30 Мб для arm64 или на ~10 Мб для armhf. * Выполнено переключение на планировщик CFQ.

source: ### Ubuntu MATE 18.04.2 Alpha 1 - March 2nd, 2019
fr: ### Ubuntu MATE 18.04.2 Alpha 1 - 2 Mars, 2019
ru: ### Ubuntu MATE 18.04.2 Alpha 1 - 2 марта 2019

source: * Initial Ubuntu MATE 18.04.2 images made available for private testing.
fr: * Les images Ubuntu MATE 18.04.2 initiales ont été rendues disponibles pour des tests privés.
ru: * Первые образы Ubuntu MATE 18.04.2 доступны для приватного тестирования.

source: ### 2017-02-16 - 16.04.2 Release for Raspbery Pi 2 and Raspberry Pi 3
fr: ### -16-02-2017 - Version 16.04.2 pour Raspbery Pi 2 et Raspberry Pi 3
ru: ### 2017-02-16 - 16.04.2 выпуск для Raspbery Pi 2 и Raspberry Pi 3

source: * Performance optimised. * Added automated first boot partition resizing. * Optimised partition offset calculations * Optimised filesystem features. * Disabled unnecessary services to reduce CPU cycles and RAM requirements. * Forked and adapted `raspi-config` to Ubuntu. * Added [pi-top](https://www.pi-top.com/) brightness and power-off support. * Backported MATE Desktop 1.16.1. * Backported BlueZ 5.41. * Backported `ffmpeg` 3.2 including Raspberry Pi hardware acceleration for MMAL decoding and OMX encoding. * Backported `i2c-tools` and `python-smbus` 3.1.2. * Updated `raspberrypi-firmware` to 1.20161215-1. * Updated `pi-bluetooth` to 0.1.2 including failsafe systemd units. * Updated `gpiozero` to 1.3.1. A simple API for controlling devices attached to the GPIO pins. * Updated `omxplayer` to 0.3.7-git20160923-dfea8c9. * Updated `nuscratch` to 20160915+2. * Updated `picamera` to 1.12. Pure Python interface to the Raspberry Pi's camera module. * Updated `pigpio` to 1.130. Library for Raspberry Pi GPIO control. * Updated `python-sense-hat` to 2.2.0. Sense HAT python. * Updated `raspberrypi-sys-mods` to 20170208, which completely replaces `raspberrypi-general-mods` * Updated `raspi-gpio` to 0.20170105. Dump the state of the BCM270x GPIOs. * Updated `rpi.gpio` to 0.6.3-1. Python GPIO module for Raspberry Pi. * Updated `rtimulib` to 7.2.1-3. Versatile C++ and Python 9-dof, 10-dof and 11-dof IMU library. * Updated `sonic-pi` to 2.10.0. * Updated `xserver-xorg-video-fbturbo` to 1.20161111~122359. * Updated Xorg via the [LTS Enablement Stack](https://wiki.ubuntu.com/Kernel/LTSEnablementStack). * Added cap1xxx; A python library designed to drive various Microchip CAP1xxx touch ICs. * Added drumhat; A python library designed to control Drum HAT. * Added envirophat; A python library designed to control Enviro pHAT. * Added explorerhat; A python library designed to control the Explorer HAT and pHAT. * Added microdotphat; A python library designed to control Micro Dot pHAT. * Added mote; A python library designed to control Mote. * Added motephat; A python library designed to control Mote pHAT. * Added pantilthat; A python library designed to control Pan-Tilt HAT. * Added pianohat; A python library designed to control Piano HAT. * Added piglow; A python library designed to drive Piglow. * Added rainbowhat; A python library designed to control Rainbow HAT. * Added scrollphat; A python library designed to control Scroll pHAT. * Added sense-emu; A client library for the Raspberry Pi Sense HAT emulator. * Added sn3218; A python library to help control the SN3218 18-channel PWM LED driver. * Added st7036; A python library to help control the ST7036 LCD driver. * Fixed first boot configuration. Ubiquity now prompts to join available WiFi networks. * [#1572793](https://bugs.launchpad.net/bugs/1572793) * Disabled SSH by default. * SSH can be enabled via `raspi-config` or creating a file named `ssh` in the `/boot` partition. * `sshguard` is also automatically enabled when you enable SSH. * Reduced the image size to 5GB, down from 8GB.
fr: * Performances optimisées. * Ajouté le redimensionnement automatisé de la partition au premier démarrage. * Optimisé les calculs compensés de la partition. * Optimisé filesystem features. * Désactivé les services non nécesaires pour réduire les cycles CPU et la RAM requis. * Forké et adapté `raspi-config` pour Ubuntu. * Ajouté la prise en charge de la luminosité et de l'extinction [pi-top](https://www.pi-top.com/). * Rétroporté MATE Desktop 1.16.1. * Rétroporté BlueZ 5.41. * Rétroporté `ffmpeg` 3.2 comprenant l'accélération matérielle pour Raspberry Pi du décodage MMAL et de l'encodage OMX. * Rétroporté `i2c-tools` et `python-smbus` 3.1.2. * Mis à jour `raspberrypi-firmware` vers 1.20161215-1. * Mis à jour `pi-bluetooth` vers 0.1.2 y compris les unités systemd à sûreté intégrée. * Mis à jour `gpiozero` vers 1.3.1. Une API simple pour contrôler les appareils attachés aux pins GPIO. * Mis à jour `omxplayer` vers 0.3.7-git20160923-dfea8c9. * Mis à jour `nuscratch` vers 20160915+2. * Mis à jour `picamera` vers 1.12. Une interface en pur Python pour le module caméra du Raspberry Pi. * Mis à jour `pigpio` vers 1.130. Bibliothèque pour le contrôle du GPIO du Raspberry Pi. * Mis à jour `python-sense-hat` vers 2.2.0. Sense HAT python. * Mis à jour `raspberrypi-sys-mods` vers 20170208, qui remplace complètement `raspberrypi-general-mods` * Mis à jour `raspi-gpio` vers 0.20170105. Vide l'état des GPIOs du BCM270x. * Mis à jour `rpi.gpio` vers 0.6.3-1. Module python GPIO pour Raspberry Pi. * Mis à jour `rtimulib` vers 7.2.1-3. Bibliothèque IMU versatile C++ et Python 9-dof, 10-dof et 11-dof. * Mis à jour `sonic-pi` vers 2.10.0. * Mis à jour `xserver-xorg-video-fbturbo` vers 1.20161111~122359. * Mis à jour Xorg par le [LTS Enablement Stack](https://wiki.ubuntu.com/Kernel/LTSEnablementStack). * Ajouté cap1xxx; Une bibliothèque python conçue pour piloter divers Microchip CAP1xxx touch ICs. * Ajouté drumhat; Une bibliothèque python conçue pour contrôler Drum HAT. * Ajouté envirophat; Une bibliothèque python conçue pour contrôler Enviro pHAT. * Ajouté explorerhat; Une bibliothèque python conçue pour contrôler l'explorateur HAT et pHAT. * Ajouté microdotphat; Une bibliothèque python conçue pour contrôler Micro Dot pHAT. * Ajouté mote; Une bibliothèque python conçue pour contrôler Mote. * Ajouté motephat; Une bibliothèque python conçue pour contrôler Mote pHAT. * Ajouté pantilthat; Une bibliothèque python conçue pour contrôler Pan-Tilt HAT. * Ajouté pianohat; Une bibliothèque python conçue pour contrôler Piano HAT. * Ajouté piglow; Une bibliothèque python conçue pour piloter Piglow. * Ajouté rainbowhat; Une bibliothèque python conçue pour contrôler Rainbow HAT. * Ajouté scrollphat; Une bibliothèque python conçue pour contrôler Scroll pHAT. * Ajouté sense-emu; Une bibliothèque client pour l'émulateur de Sense HAT du Raspberry Pi. * Ajouté sn3218; Une bibliothèque python pour faciliter le contrôle du pilote PWL LED 18-canaux SN3218. * Ajouté st7036; Une bibliothèque python pour faciliter le contrôle du pilote LCD ST7036. * Corrigé la configuration au premier démarrage. Ubiquity demande dorénavant de rejoindre les réseaux WiFi disponibles. * [#1572793](https://bugs.launchpad.net/bugs/1572793) * Désactivé SSH par défaut. * SSH peut être activé par `raspi-config` ou en créant un fichier nommé `ssh` dans la partition `/boot`. * `sshguard` est également automatiquement activé si vous activé le SSH. * Réduit la taille de l'image à 5GO, qui était auparavant de 8GO.
ru: * Оптимизация производительности. * Добавлено автоматизированное изменение размера раздела при загрузке. * Оптимизирован расчет смещений разделов * Оптимизированы возможности файловых систем. * Отключены ненужные сервисы для уменьшения нагрузки на процессор и уменьшения использования ОЗУ. * Создано ответвление `raspi-config` для адаптации к Ubuntu. * Добавлены [pi-top](https://www.pi-top.com/) для регулировки яркости и выключения. * Обратное портирование MATE Desktop 1.16.1. * Обратное портирование BlueZ 5.41. * Обратное портирование `ffmpeg` 3.2 включая аппартное ускорение Raspberry Pi для MMAL декодирования и OMX кодирования. * Обратное портирование `i2c-tools` и `python-smbus` 3.1.2. * Обновлен `raspberrypi-firmware` до 1.20161215-1. * Обновлен `pi-bluetooth` до 0.1.2 включая отказоустойчивые модули systemd. * Обновлен `gpiozero` до 1.3.1. Простой API для управления устройствами, подключенными к выводам GPIO. * Обновлен `omxplayer` до 0.3.7-git20160923-dfea8c9. * Обновлен `nuscratch` до 20160915+2. * Обновлен `picamera` до 1.12. Реализация интерфейса модуля камеры для Raspberry Pi на чистом Python. * Обновлен `pigpio` до 1.130. Библиотека для управления GPIO Raspberry Pi. * Обновлен `python-sense-hat` до 2.2.0. Поддержка Sense HAT на python. * Обновлен `raspberrypi-sys-mods` до 20170208, как полная замена `raspberrypi-general-mods` * Обновлен `raspi-gpio` до 0.20170105. Выводит состояние GPIO BCM270x. * Обновлен `rpi.gpio` до 0.6.3-1. Модуль Python для GPIO платы Raspberry Pi. * Обновлен `rtimulib` до 7.2.1-3. Быстрая библиотека на C++ и Python 9-dof (степеней свободы), 10-dof и 11-dof IMU. * Обновлен `sonic-pi` до 2.10.0. * Обновлен `xserver-xorg-video-fbturbo` до 1.20161111~122359. * Обновлен Xorg через [LTS Enablement Stack](https://wiki.ubuntu.com/Kernel/LTSEnablementStack). * Добавлена cap1xxx; Библиотека python для различных микросхем Microchip CAP1xxx для сенсорных экранов. * Добавлена drumhat; Библиотека python для управления Drum HAT. * Добавлена envirophat; Библиотека python для управления Enviro pHAT. * Добавлена explorerhat; Библиотека python для управления Explorer HAT и pHAT. * Добавлена microdotphat; Библиотека python для управления Micro Dot pHAT. * Добавлена mote; Библиотека python для управления Mote. * Добавлена motephat; Библиотека python для управления Mote pHAT. * Добавлена pantilthat; Библиотека python для управления Pan-Tilt HAT. * Добавлена pianohat; Библиотека python для управления Piano HAT. * Добавлена piglow; Библиотека python для управления Piglow. * Добавлена rainbowhat; Библиотека python для управления Rainbow HAT. * Добавлена scrollphat; Библиотека python для управления Scroll pHAT. * Добавлена sense-emu; Клиентская библиотека для эмулятора Raspberry Pi Sense HAT. * Добавлена sn3218; Библиотека python для управления 18-канальным PWM драйвером LED SN3218. * Добавлена st7036; Библиотека python для управления экраном ST7036 LCD. * Исправлена конфигурация при первой загрузке. Ubiquity теперь предлагает подключиться к доступным сетям WiFi. * [#1572793](https://bugs.launchpad.net/bugs/1572793) * Выключен SSH по умолчанию. * SSH может быть включен через `raspi-config` или путем создания файла с именем `ssh` в разделе `/boot`. * `sshguard` включается автоматически если вы включаете SSH. * Размер образа уменьшен с 8 Гб до 5 Гб.

source: ### 2016-04-24 - 16.04 Final Release for Raspbery Pi 2 and Raspberry Pi 3
fr: ### -24-04-2016 - Version 16.04 Finale pour Raspbery Pi 2 et Raspberry Pi 3
ru: ### 2016-04-24 - 16.04 Final Release для Raspbery Pi 2 и Raspberry Pi 3

source: * Added OpemMAX IL hardware accelerated video playback to VLC. * To enable hardware accelerated video playback go to `Tools` -> `Preferences` -> `Video` and select `OpenMax IL`. * Added MMAL hardware accelerated video playback to ffmpeg. * To use hardware accelerated video playback with `ffplay` you must specify the `h264_mmal` codec - `ffplay -vcodec h264_mmal video.mp4` * Increased the minimum microSDHC card size to 8GB. * Removed tboplayer.
fr: * Ajouté l'accélération matérielle de la lecture vidéo OpenMAX IL dans VLC. * Pour activer l'accélération matérielle de la lecture vidéo, allez dans `Outils` -> `Préférences` -> `Vidéo` et sélectionnez `OpenMax IL`. * Ajouté l'accélération matérielle de la lecture vidéo MMAL à ffmpeg. * Pour utiliser l'accélération matérielle de la lecture vidéo dans `ffplay` vous devez spécifer le codec `h264_mmal` - `ffplay -vcodec h264_mmal video.mp4` * Augmenté la taille minimum de la carte microSDHC à 8GO. * Supprimé tboplayer.
ru: * Добавлено аппаратное ускорение воспроизведения видео OpemMAX IL в VLC. * Для включения аппаратного ускорения воспроизведения видео перейдите в меню `Tools` -> `Preferences` -> `Video` и выберите `OpenMax IL`. * Добавлено аппаратное ускорение воспроизведения видео MMAL в ffmpeg. * Для использования аппаратного ускорения в `ffplay` вы должны задать использование кодека `h264_mmal` - `ffplay -vcodec h264_mmal video.mp4` * Увеличен минимальный размер карты памяти microSDHC до 8 Гб. * Удален tboplayer.

source: ### 2016-04-05 - 16.04 Beta 2 for Raspberry Pi 2 and Raspberry Pi 3
fr: ### -05-04-2016 - 16.04 Beta 2 pour Raspberry Pi 2 et Raspberry Pi 3
ru: ### 2016-04-05 - 16.04 Beta 2 для Raspberry Pi 2 и Raspberry Pi 3

source: * Updated to Ubuntu MATE 16.04 including the new Welcome which comes with Raspberry Pi specific features. * Updated BlueZ 5.37 with patches to support the Raspberry Pi 3 integrated Bluetooth. * Ubuntu MATE 16.04 now supports the on-board Raspberry Pi 3 Bluetooth and Wifi. * Updated to Linux 4.1.19. * Updated to `raspberrypi-firmware` 1.20160315-1. * Updated to `omx-player` 0.3.7~git20160206~cb91001. * Updated to `wiringpi` 2.32. * Updated to `nuscratch` 20160115. * Updated to `sonic-pi` 2.9.0. * Migrated configuration tweaks to `raspberrypi-general-mods` and `raspberrypi-sys-mods`. * Experimental hardware accelerated OpenGL can be enabled, *if you know how* `;-)`
fr: * Mise à jour vers Ubuntu MATE 16.04 apportant le nouveau Bienvenue qui vient avec des fonctionnalités propres au Raspberry Pi. * Mise à jour de BlueZ 5.37 avec des correctifs pour prendre en charge le Bluetooth intégré du Raspberry Pi 3. * Ubuntu MATE 16.04 prend désormais en charge le Wi-Fi et le Bluetooth intégrés du Raspberry Pi 3. * Mise à jour de Linux 4.1.19. * Mise à jour de `raspberrypi-firmware` 1.20160315-1. * Mise à jour de `omx-player`0.3.7~git20160206~cb91001. * Mise à jour de `wiringpi` 2.32. * Mise à jour de `nuscratch` 20160115 * Mise à jour de `sonic-pi` 2.9.0. * Migré les ajustements de configuration vers `raspberrypi-general-mods` et `raspberrypi-sys-mods`. * L'accélération matérielle expérimentale de l'OpenGL peut désormais être activée, *si vous savez vous y prendre* `;-)`
ru: * Обновление до Ubuntu MATE 16.04 включая новое приложение Welcome, которое содержит специфичные для Raspberry Pi возможности. * Обновлен BlueZ 5.37 с патчами для поддержки Bluetooth, встроенного в Raspberry Pi 3. * Ubuntu MATE 16.04 теперь поддерживает встроенные в Raspberry Pi 3 модули Bluetooth и Wifi. * Обновление Linux до 4.1.19. * Обновление `raspberrypi-firmware` до 1.20160315-1. * Обновление `omx-player` до 0.3.7~git20160206~cb91001. * Обновление `wiringpi` до 2.32. * Обновление `nuscratch` до 20160115. * Обновление `sonic-pi` до 2.9.0. * Настройки конфигурации перемещены в `raspberrypi-general-mods` и `raspberrypi-sys-mods`. * Экспериментальное ускорение OpenGL теперь может быть задействовано, *если вы знаете как* `;-)`

source: ### 2016-02-27 - 15.10.3 for Raspberry Pi 2 and Raspberry Pi 3
fr: ### -27-02-2016 - 15.10.3 pour Raspberry Pi 2 et Raspberry Pi 3
ru: ### 2016-02-27 - 15.10.3 для Raspberry Pi 2 и Raspberry Pi 3

source: * Added support for Raspberry Pi 3 integrated Wifi. * Updated BlueZ 5.35 with patch to support the Raspberry Pi 3 integrated Bluetooth. * Support for the integrated Raspberry Pi 3 Bluetooth is not working but we hope to have an update that addresses this soon.
fr: * Ajouté la prise en charge du Wi-FI intégré du Raspberry Pi 3. * Mis à jour BlueZ 5.35 avec le correctif pour prendre en charge le Bluetooth intégré du Raspberry Pi 3. * La prise en charge pour le Bluetooth intégré du Raspberry Pi 3 ne fonctionne pas mais nous avons bon espoir de régler ce souci avec un correctif bientôt.
ru: * Добавлена поддержка встроенного в Raspberry Pi 3 модуля Wifi. * Обновление BlueZ до 5.35 с патчем для поддержки встроенного в Raspberry Pi 3 модуля Bluetooth. * Поддержка встроенного в Raspberry Pi 3 модуля Bluetooth не работает, но мы надеемся на выпуск обновления для скорого решения этой проблемы.

source: ### 2016-02-26 - 15.10.2 for Raspberry Pi 2 and Raspberry Pi 3 (internal testing build)
fr: ### -26-02-2016 - Version 15.10.2 pour Raspberry Pi 2 et Raspberry Pi 3 (version de test interne)
ru: ### 2016-02-26 - 15.10.2 для Raspberry Pi 2 и Raspberry Pi 3 (образ для внутреннего тестирования)

source: * Added support for Raspberry Pi 3 Model B. * No Raspberry Pi 3 integrated Wifi or Bluetooth support. * Updated to Linux 4.1.18. * Updated all packages to the current version in the Ubuntu 15.10 archive. * Fixed an issue where the SSH host keys were not correctly regenerated on first boot.
fr: * Ajout de la prise en charge du Raspberry Pi 3 Model B. * Pas de prise en charge du Wi-Fi ni du Bluetooth intégrés du Raspberry Pi 3. * Mis à jour vers Linux 4.1.18. * Mis à jour de tous les paquets vers la version actuelle de l'archive d'Ubuntu 15.10. * Corrigé un problème où les clés hôtes du SSH n'étaient pas correctement régénérées lors du premier démarrage.
ru: * Добавлена поддержка для Raspberry Pi 3 Model B. * Нет поддержки встроенных в Raspberry Pi 3 модулей Wifi и Bluetooth. * Обновление Linux до 4.1.18. * Все пакеты обновлены до актуальных версий, входящих в архив Ubuntu 15.10. * Исправлена ошибка повторной генерации серверных SSH ключей при первой загрузке.

source: ### 2015-12-21 - 15.10.1 for Raspberry Pi 2 Update
fr: ### -21-12-2015 - Mise à jour 15.10.1 pour Raspberry Pi 2
ru: ### 2015-12-21 - 15.10.1 для Raspberry Pi 2 Update

source: * Migrated the build to [Ubuntu Pi Flavour Maker](https://ubuntu-pi-flavour-maker.org) project. * Images are now XZ compressed, to save bandwidth and make them compatible with GNOME Disks. * Added `python-gpiozero` and `python3-gpizero` 1.0.0 as packages. * Updated Scratch to 20151111. * Updated to Linux 4.1.15. * Reverted change to `/boot/config.txt` so audio is not forced to output over HDMI because this introduced more compatibility issues that it solved.
fr: * Migré la version vers le projet [Fabricant de Variante Pi Ubuntu](https://ubuntu-pi-flavour-maker.org) project. * Les images sont dorénavant compressées en XZ, pour sauver de la bande passante et les rendre compatibles avec GNOME Disques. * Ajouté les paquets `python-gpiozero` et `python3-gpizero` 1.0.0. * Mis à jour de Scratch en version 20151111. * Mis à jour Linux en version 4.1.15. * Annulé un changement à `/boot/config.txt` de sorte que l'audio ne soit pas forcé vers la sortie HDMI car cela amenait plus de problèmes de compatibilité que cela n'en résolvait.
ru: * Сборочных процесс перенесен в проект [Ubuntu Pi Flavour Maker](https://ubuntu-pi-flavour-maker.org). * Образы теперь имеют сжатие XZ, для сохранения пропускной способности и совместимости с GNOME Disks. * Добавлены `python-gpiozero` и `python3-gpizero` 1.0.0 в виде пакетов. * Обновление Scratch до 20151111. * Обновление Linux до 4.1.15. * Отмена изменения в `/boot/config.txt`, теперь звук не направляется принудительно через HDMI; прошлое решение создало больше проблем совместимости, чем решило.

source: ### 2015-10-22 - 15.10 for Raspberry Pi 2 Final Release
fr: ### -22-10-2015 - Version 15.10 Finale pour Raspberry Pi 2
ru: ### 2015-10-22 - 15.10 для Raspberry Pi 2 Final Release
