Repository: ubuntu-mate/ubuntu-mate.org
Catalog: _i18n/*/ports-umpc.po
Languages: ru

source: title: Ultra Mobile PCs
ru: title: Ультра-мобильные ПК

source: # Ubuntu MATE for Ultra Mobile PCs
ru: # Ubuntu MATE для ультра-мобильных ПК

source: The Ubuntu MATE team offers a bespoke images for the [GPD Pocket](https://www.gpd.hk/gpdpocket), [GPD Pocket 2](https://www.gpd.hk/gpdpocket2), [GPD WIN 2](https://www.gpd.hk/gdpwin2), [GPD MicroPC](https://www.gpd.hk/gpdmicropc) and [Topjoy Falcon](https://www.kickstarter.com/projects/440069565/falcon-worlds-first-8-inch-2-in-1-laptop) that include the hardware specific tweaks to get these devices working *"out of the box"* without any faffing about. Some models of the OneMix Yoga devices are also supported.
ru: Команда Ubuntu MATE предлагает индивидуальные установочные образы для [GPD Pocket](https://www.gpd.hk/gpdpocket), [GPD Pocket 2](https://www.gpd.hk/gpdpocket2), [GPD WIN 2](https://www.gpd.hk/gdpwin2), [GPD MicroPC](https://www.gpd.hk/gpdmicropc) и [Topjoy Falcon](https://www.kickstarter.com/projects/440069565/falcon-worlds-first-8-inch-2-in-1-laptop), которые включают аппаратные настройки, обеспечивающие работу этих устройств *"из коробки"* без каких-либо забот. Некоторые модели OneMix Yoga также поддерживаются.

source: Ultra Mobile PCs (UMPC) have had something of a resurgence in recent years thanks to very successfull crowd funding campaigns for netbook style laptops featuring a high resolution touch displays housed in an aluminium alloy body. These scripts for UMPC devices are based on the excellent work by [Hans de Goede](https://hansdegoede.livejournal.com/), [nexus511](https://apt.nexus511.net/), [stockmind](https://github.com/stockmind/gpd-pocket-ubuntu-respin) and many others.
ru: Ультра мобильные ПК (УМПК) в последние годы возродились благодаря нескольким краудфандинговым кампаниям для устройств класса нетбуков, предлагающих сенсорные экраны высокого разрешения и корпуса из алюминиевого сплава. Скрипты для устройств УМПК основаны на превосходных результатах работы [Ганса де Гёде](https://hansdegoede.livejournal.com/), [nexus511](https://apt.nexus511.net/), [stockmind](https://github.com/stockmind/gpd-pocket-ubuntu-respin) и многих других.

source: {:.center .small} ![Ubuntu MATE running on the GPD Pocket (left) and GPD Pocket 2 (right)](/images/blog/gpd-pockets.jpg) **Ubuntu MATE running on the GPD Pocket (left) and GPD Pocket 2 (right)**
ru: {:.center .small} ![Ubuntu MATE работает на GPD Pocket (слева) и GPD Pocket 2 (справа)](/images/blog/gpd-pockets.jpg) **Ubuntu MATE работает на GPD Pocket (слева) и GPD Pocket 2 (справа)**

source: ## What works
ru: ## Что работает?

source: The Ubuntu MATE images for the UMPCs adds the following tweaks:
ru: Образы Ubuntu MATE для УМПК добавляют следующие улучшения:

source: * Enable **frame buffer and Xorg display rotation**. * Supports `modesetting` *and* `xorg-video-intel` display drivers. * Enable **TearFree rendering by default**. * Enable touch screen rotation for Xorg and Wayland. * Enable **scroll wheel emulation** for Xorg. * While holding down the **right track point button** on the Pocket, Pocket 2 & Topjoy Falcon. * While holding down the **centre track point button** on the MicroPC. * Enable double size console (tty) font resolution. * Enable **resolution scaling** for 1920x1200 displays. *(MATE Desktop only)* * Results in an effective resolution of 1280x800 to make the small display panels easily readable. * Simple to disable if you want to restore full resolution. * **GRUB is usable post-install**. * GPD Pocket, WIN 2, MicroPC & TopJoy Falcon GRUB is rotated 90 degress, but functional. * GPD Pocket 2 GRUB is correctly rotated and functional. * GPD Pocket BRMC4356 WiFi firmware enabled by default. * GPD Pocket fan control kernel module enable by default.
ru: * Включение **поворота кадрового буфера и дисплея в Xorg**. * Поддержка драйверов экрана `modesetting` *и* `xorg-video-intel`. * Включение **рендеринга TearFree по умолчанию**. * Включение поворота сенсорного экрана в Xorg и Wayland. * Включение **эмуляции колеса прокрутки** в Xorg. * При удержании **правой кнопки трек-поинта** на моделях Pocket, Pocket 2 и Topjoy Falcon. * При удержании **центральной кнопки трек-поинта** на модели MicroPC. * Включение двукратного масштабирования шрифта в консоли (tty). * Включение **масштабирования разрешения** для экранов 1920x1200 *(только рабочий стол MATE)*. * Позволяет получить эффективное разрешение 1280x800 для улучшение читаемости информации на маленьком экране. * Может быть легко выключено если вы хотите использовать полноценное разрешение. * **GRUB может быть нормально использован после установки**. * На моделях GPD Pocket, WIN 2, MicroPC и TopJoy Falcon меню GRUB повернуто на 90 градусов и при этом работает. * На модели GPD Pocket 2 окно GRUB правильно повернуто и нормально работает. * Прошивка BRMC4356 WiFi для GPD Pocket задействована по умолчанию. * Драйвер ядра для контроля вентилятора GPD Pocket задействован по умолчанию.

source: ## Known Issues
ru: ## Известные проблемы

source: ### GPD Pocket, WIN 2, MicroPC and Topjoy Falcon
ru: ### GPD Pocket, WIN 2, MicroPC и Topjoy Falcon

source: * The GRUB2 menu is rotated 90 degrees on the GPD Pocket, MicroPC and Topjoy Falcon. * The workaround is to tilt your head. * The built in speaker in the GPD Pocket is mono and doesn't play audio from the right channel. * The workaround is to use headphones connected the 3.5mm audio jack.
ru: * Меню GRUB2 повернуто на 90 градусов на устройствах GPD Pocket, MicroPC и Topjoy Falcon. * Проблема решается наклоном головы. * Встроенный в устройство GPD Pocket динамик имеет один канал и не может воспроизводить звук правого канала. * Проблема решается использованием наушников, подключенных к аудио-разъему 3.5 мм.

source: * The boot menu is not displayed in the GPD Pocket 2 live media. * The workaround is to wait and the system will boot after a few seconds or press <kbd>Enter</kbd> to boot immeditately. * However, **GRUB is fully functional and usable post-install**.
ru: * Меню загрузки живого установочного носителя не отображается на экране GPD Pocket 2. * Проблема решается ождиданием загрузки устройства и нажатием <kbd>Enter</kbd> для немедленной загрузки. * Однако, **после установки GRUB оказывается полнофункциональным**.

source: ### GPD Pocket, Pocket 2 & MicroPC, Topjoy Falcon
ru: ### GPD Pocket, Pocket 2 и MicroPC, Topjoy Falcon

source: * The Plymouth splash screen is not rotated. * The workaround is to not care.
ru: * Окно загрузочной заставки Plymouth не повернуто. * Решением проблемы является ее игнорирование.

source: title = "Download" text = "Run Ubuntu MATE on your GPD Pocket, GPD Pocket 2, GPD WIN 2, GPD MicroPC or Topjoy Falcon today!" button_text = "Download" button_url = "/download/"
ru: title = "Загрузка" text = "Запустите Ubuntu MATE на вашем GPD Pocket, GPD Pocket 2, GPD WIN 2, GPD MicroPC или Topjoy Falcon сегодня!" button_text = "Загрузка" button_url = "/download/"

source: ## Disable desktop session scaling
ru: ## Отключение масштабирования сессии рабочего стола

source: If you want to restore the full native resolution of display then open *Startup Applications* from the *Control Center*. Find the entry called *GPD Pocket Display Scaler* in the *Startup Programs* tab and untick it. Log out and back in and the full 1920x1200 resolution is restored.
ru: Если вы хотите восстановить полное родное разрешение экрана, то запустите *Центр управления* и откройте настройку *Запускаемые приложения*. Найдите строку *GPD Pocket Display Scaler* на вкладке *Автоматически запускаемые программы* и снимите отметку с нее. Завершите сеанс и зайдите в систему снова для восстановления полного 1920x1200 разрешения экрана.

source: {:.center} ![Disabling the UMPC Pocket Display Scaler via Startup Applications Preferences](/images/blog/gpd-pocket-display-scaler.png) **Disabling the UMPC Pocket Display Scaler via Startup Applications Preferences**
ru: {:.center} ![Отключение UMPC Pocket Display Scaler через настройку Запускаемые приложения](/images/blog/gpd-pocket-display-scaler.png) **Отключение UMPC Pocket Display Scaler через настройку Запускаемые приложения**

source: ## How were these images created?
ru: ## Как были созданы эти установочные образы?

source: With a script called `umpc-ubuntu-respin.sh` which you can find in the following GitHub repository:
ru: Образы были созданы с помощью скрипта `umpc-ubuntu-respin.sh`, который вы можете найти в репозитории GitHub:

source: ## Accessing UMPC boot menus
ru: ## Вход в меню загрузки УМПК

source: Switch the device on, immediately hold the <kbd>Fn</kbd> key and tap the <kbd>F7</kbd> key until the Boot Manager screen appears.
ru: Включите устройство, сразу же удерживайте кнопку <kbd>Fn</kbd> и нажимайте на кнопку <kbd>F7</kbd> до появления экрана Boot Manager.

source: ### GPD Pocket 2 & Topjoy Falcon
ru: ### GPD Pocket 2 и Topjoy Falcon

source: Switch the device on, immediately hold the <kbd>Fn</kbd> key and tap the <kbd>F12</kbd> key until the Boot Manager screen appears.
ru: Включите устройство, сразу же удерживайте кнопку <kbd>Fn</kbd> и нажимайте на кнопку <kbd>F12</kbd> до появления экрана Boot Manager.

source: ## Accessing UMPC BIOS menus
ru: ## Вход в меню BIOS УМПК

source: Switch the device on, immediately hold the <kbd>Fn</kbd> key and tap the <kbd>F2</kbd> key until the BIOS appears.
ru: Включите устройство, сразу же удерживайте кнопку <kbd>Fn</kbd> и нажимайте на кнопку <kbd>F2</kbd> до появления BIOS.

source: ## Feedback
ru: ## Обратная связь

source: These images for the GPD and Topjoy devices are community supported, please post all feedback via the [community forum](https://ubuntu-mate.community/).
ru: Установочные образы для устройств GPD и Topjoy поддерживаются сообществом, поэтому вы можете получить поддержку на нашем [форуме сообщества](https://ubuntu-mate.community/).
