Repository: ubuntu-mate/ubuntu-mate.org
Catalog: _i18n/*/requirements.po
Languages: fr

source: title: System Requirements
fr: title: Configuration requise

source: Ubuntu MATE has modest hardware requirements, making it is suitable for modern workstations, single board computers and older hardware alike. Ubuntu MATE makes modern computers fast and old computers usable.
fr: Ubuntu MATE requiert une configuration modeste, le rendant parfaitement adapté aux stations de travail modernes, aux ordinateurs à carte unique et au matériel plus ancien. Ubuntu MATE rend les ordinateurs modernes rapides et les ordinateurs moins récents utilisables.

source: ### Desktop and Laptop Computers
fr: ### Ordinateurs fixes et portables

source: | | Minimum | Recommended | | ----------------- | ----------------- | ------------------------- | | **CPU** | Pentium M 1.0GHz | Core 2 Duo 1.6GHz | **CPU Architecture** | [i386] (until 2021) | [amd64] | **RAM** | 1 GB | 4 GB | **Storage** | 8 GB | 16 GB | **Boot Media** | Bootable DVD-ROM | Bootable DVD-ROM or USB Flash Drive | **Display** | 1024 x 768 | 1440 x 900 or higher (with graphics acceleration)
fr: | | Minimum | Recommandé | | ----------------- | ----------------- | ------------------------- | | **CPU** | Pentium M 1.0GHz | Core 2 Duo 1.6GHz | **CPU Architecture** | [i386] (jusqu'en 2021) | [amd64] | **RAM** | 1 GO | 4 GO | **Stockage** | 8 GO | 16 GO | **Media de démarrage** | DVD-ROM amorçable | DVD-ROM or USB Flash Drive | **Affichage** | 1024 x 768 | 1440 x 900 ou plus (avec accélération graphique)

source: Only the **B models** of the Raspberry Pi family are supported:
fr: Seuls les **modèles B** de la famille Raspberry Pi sont supportés:

source: * Raspberry Pi 2 * Raspberry Pi 3 * Raspberry Pi 3+ * Raspberry Pi 4 (all memory sizes)
fr: * Raspberry Pi 2 * Raspberry Pi 3 * Raspberry Pi 3+ * Raspberry Pi 4 (toutes tailles de mémoire)

source: All models support the [armhf] architecture. The Raspberry Pi 3 and newer can also take advantage of the 64-bit CPU using the [arm64] release.
fr: Tous les modèles supportent l'architecture [armhf]. Le Raspberry Pi 3 et plus récents peuvent aussi tirer profit du CPU 64-bit en utilisant la version [arm64].

source: The micro-SD card needs to be a minimum of 5 GB.
fr: La taille de la carte micro-SD doit être au minimum de 5 GO.

source: ### Hardware Ports
fr: ### Portages Matériels

source: Ubuntu MATE has been officially ported to, and works great on:
fr: Ubuntu MATE a été officiellement porté sur, et fonctionne très bien sur:

source: | Codename | Compatible with | | --------------------- | ------------------------------------------------- | | [gpd_pocket](/download/gpd_pocket/) | Original GPD Pocket. | [gpd_pocket_2](/download/gpd_pocket_2/)| GPD Pocket 2, GPD Win 2, OneMix Yoga 1s and OneMix Yoga 2. | [gpd_micropc](/download/gpd_micropc/) | GPD MicroPC | [gpd_p2_max](/download/gpd_p2_max/) | Topjoy Falcon
fr: | Nom de code | Compatible avec | | --------------------- | ------------------------------------------------- | | [gpd_pocket](/download/gpd_pocket/) | GPD Pocket originel. | [gpd_pocket_2](/download/gpd_pocket_2/)| GPD Pocket 2, GPD Win 2, OneMix Yoga 1s et OneMix Yoga 2. | [gpd_micropc](/download/gpd_micropc/) | GPD MicroPC | [gpd_p2_max](/download/gpd_p2_max/) | Topjoy Falcon
