Repository: ubuntu-mate/ubuntu-mate.org
Catalog: _i18n/*/shop.po
Languages: fr, ru

source: title: Emporium
fr: title: Marché
ru: title: Магазин

source: ## Welcome to the Emporium!
fr: ## Bienvenue au marché !
ru: ## Добро пожаловать в магазин!

source: We offer shiny new computers, books and other merchandise to show off to your friends and family! Pick a category above.
fr: Nous vous proposons des ordinateurs flambant neufs, des livres et d'autres articles pour mettre en valeur Ubuntu MATE auprès de votre famille et de vos amis ! Choisissez une catégorie au-dessus.
ru: Мы предлагаем блестящие новые компьютеры, книги и другие товары, чтобы показать их вам. друзья и семья! Выберите категорию выше.

source: {:.center} ![A shopping trolley with Ubuntu MATE Merchandise](/images/shop/shop.svg)
fr: {:.center} ![Un caddie de courses avec de la marchandise Ubuntu MATE](/images/shop/shop.svg)
ru: {:.center} ![Тележка с покупками из магазина Ubuntu MATE](/images/shop/shop.svg)

source: title: Books
fr: title: Livres
ru: title: Книги

source: - group: Books items:
fr: - group: Livres items:
ru: - group: Книги items:

source: - name: "Ubuntu MATE: Upgrading from Windows or macOS - Second Edition" price: $10.00 - $18.50 USD img: /images/shop/books/Upgrading-to-UM.png url: https://www.amazon.com/dp/ASIN/1658872681 description: >-
fr: - name: "Ubuntu MATE: Mettre à niveau à partir de Windows ou macOS - Seconde Édition" price: 10.00$ - 18.50$ USD img: /images/shop/books/Upgrading-to-UM.png url: https://www.amazon.com/dp/ASIN/1658872681 description: >-

source: This book is a detailed discussion of Ubuntu MATE and its major applications. Written for users switching from other operating systems, it’s not ONLY for users switching from other systems. It’s also a reference for everyone using Ubuntu MATE. If you’re upgrading from Windows or OSX, you’ll find that our suggestions for personalizing Ubuntu MATE will help you feel right at home.
fr: Ce livre est une présentation détaillée d'Ubuntu MATE et de ses applications majeures. Écrit pour les utilisateurs provenant d'autres systèmes d'exploitation, il n'est pas SEULEMENT à destination des utilisateurs provenant d'autres systèmes. Il est aussi une référence pour quiconque utilisant Ubuntu MATE. Si vous venez de Windows ou OSX, vous verrez que nos suggestions pour personnaliser Ubuntu MATE vous aideront à vous sentir chez vous.
ru: Эта книга представляет собой детальное обсуждение Ubuntu MATE и его основных приложений. Написана для пользователей, переключившихся с других операционных систем и не только для них. Также эта книга для всех тех, кто использует Ubuntu MATE. Если вы обновляетесь с Windows или OSX, вы найдете много рекомендаций по персонализации Ubuntu MATE чтобы вы чувствовали себя как дома.

source: - name: "Using Ubuntu MATE and Its Applications: Ubuntu MATE 20.04 LTS Edition" price: $15.99 - 25.99 USD img: /images/shop/books/Using-UM.png url: http://www.amazon.com/dp/ASIN/B084DFZMFC description: >-
fr: - name: "utiliser Ubuntu MATE et ses applications: Ubuntu MATE Édition 20.04 LTS" Price: 15.99$ - 25.99$ USD img: /images/shop/books/Using-UM.png url: http://www.amazon.com/dp/ASIN/B084DFZMFC description: >-

source: This book is written for computer users who want a reference detailed enough to help them to learn about Ubuntu MATE and its applications and to build their confidence and competence in using them to get things done.
fr: Ce livre est écrit pour les utilisateurs d'ordinateur qui veulent une référence assez détaillée pour leur permettre d'en apprendre plus sur Ubuntu MATE et ses applications et pour gagner en confiance et compétence en les utilisant pour obtenir des résultats.
ru: Эта книга написана для пользователей, желающих наиболее подробно узнать об Ubuntu MATE и ее приложениях и укрепить их уверенность и компетентность в использовании системы для достижения целей.

source: title: Apparel
fr: title: Vêtements
ru: title: Атрибутика

source: - group: Apparel items:
fr: - group: Vêtements items:
ru: - group: Атрибутика items:

source: - name: Polo Shirts, T-Shirts, Hoodies and Jackets price: €29 - €45 img: /images/shop/shirts.png url: https://www.hellotux.com/ubuntu-mate description: >-
fr: - name: Polos, T-Shirts, Sweats à Capuche et Vestes price: 29€ - 45€ img: /images/shop/shirts.png url: https://www.hellotux.com/ubuntu-mate description: >-
ru: - name: Рубашки поло, футболки, толстовки и куртки price: €29 - €45 img: /images/shop/shirts.png url: https://www.hellotux.com/ubuntu-mate description: >-

source: HELLOTUX is the family business of Gábor Kum, a Linux system administrator, software developer and Linux user since 1999. HELLOTUX started making their Linux shirts in 2002 and carefully embroider every shirt individually using a programmable embroidery machine, all powered by Linux. HELLOTUX is an international store that delivers worldwide.
fr: HELLOTUX est l'entreprise familiale de Gábor Kum, un administrateur système Linux, développeur de logiciels et utilisateur de Linux depuis 1999. HELLOTUX ont commencé à fabriquer leurs T-shirts Linux en 2002 et brodent soigneusement chaque t-shirt individuellement en utilisant une machine de broderie programmable, complètement alimentée par Linux. HELLOTUX est une boutique internationale qui livre dans le monde entier.
ru: HELLOTUX это семейных бизнес Gábor Kum, системного администратора Linux, разработчика программного обеспечения и пользователя Linux с 1999 года. HELLOTUX начали производить футболки с Linux в 2002 и тщательно вышивают каждую футболку индивидуально с использованием вышивальной машины, управляемой Linux. HELLOTUX доставляет продукцию по всему миру.

source: - name: Mugs, Mousemats and more T-Shirts (European) price: £9.99 - £15.99 img: /images/shop/mug.png url: https://shop.spreadshirt.co.uk/ubuntu-mate/ description: >-
fr: - name: Mugs, Tapis de Souris et plus de T-Shirts (Europe) price: 9.99£ - 15.99£ img: /images/shop/mug.png url: https://shop.spreadshirt.co.uk/ubuntu-mate/ description: >-
ru: - name: Кружки, коврики для мыши и другие футболки (европейские) price: £9.99 - £15.99 img: /images/shop/mug.png url: https://shop.spreadshirt.co.uk/ubuntu-mate/ description: >-

source: Ubuntu MATE has two shops for apparel, one based in Europe and one based in the Americas. Both shops deliver worldwide and stock the same items.
fr: Ubuntu MATE a deux magasins pour les vêtements, l'un basé en Europe et l'autre basé en Amérique. Les deux magasins livrent dans le monde entier et stockent les mêmes articles.
ru: Ubuntu MATE имеет два магазина атрибутики - один в Европе, один в Америке. Оба магазина имеют одинаковый ассортимент товаров.

source: - name: Mugs, Mousemats and more T-Shirts (Americas) price: $11.99 - $25.99 img: /images/shop/mug.png url: https://shop.spreadshirt.com/ubuntu-mate/ description: >-
fr: - name: Mugs, Tapis de Souris et plus de T-Shirts (Amérique) price: 11.99$ - 25.99$ img: /images/shop/mug.png url: https://shop.spreadshirt.com/ubuntu-mate/ description: >-
ru: - name: Кружки, коврики для мыши и другие футболки (американские) price: $11.99 - $25.99 img: /images/shop/mug.png url: https://shop.spreadshirt.com/ubuntu-mate/ description: >-

source: If you are located in Africa, Asia, Middle East or Ocenia you may want to check both stores to see which offer the most favourable shipping costs to your location.
fr: Si vous vivez en Afrique, Asie, Moyen-Orient ou Océanie, vous devriez parcourir les deux magasins pour savoir lequel offre les frais de livraison les plus avantageux vers votre domicile.
ru: Если вы находитесь в Африке, Азии, Средней Азии или Океании - вы можете воспользоваться услугами одного из магазинов и найти наиболее подходящую стоимость доставки товаров к вам.
